package org.example.functional.table_maker;

import org.example.CounterMenuTest;
import org.example.visual.Console;

import java.io.PrintStream;
import java.sql.Connection;
import java.sql.PreparedStatement;
import java.sql.SQLException;

public class OldInserter {

    public static Console console = CounterMenuTest.console;
    public static PrintStream stream = new PrintStream(console);
    public static void insertDefaultCountries(Connection connection) {
        try {
            String query = "INSERT INTO countries\n" +
                    "VALUES ('Afghanistan',1,'Афганистан'),('Albania',2,'Албания'),('Algeria',3,'Алжир'),('Andorra',4," +
                    "'Андорра'),('Angola',5,'Ангола'),('Antigua and Barbuda',6,'Антигуа и Барбуда'),('Argentina',7," +
                    "'Аргентина'),('Armenia',8,'Армения'),('Australia',9,'Австралия'),('Austria',10,'Австрия')," +
                    "('Azerbaijan',11,'Азербайджан'),('Bahamas',12,'Багамы'),('Bahrain',13,'Бахрейн'),('Bangladesh',14," +
                    "'Бангладеш'),('Barbados',15,'Барбадос'),('Belarus',16,'Беларусь'),('Belgium',17,'Бельгия')," +
                    "('Belize',18,'Белиз'),('Benin',19,'Бенин'),('Bhutan',20,'Бутан'),('Bolivia',21,'Боливия'),('Bosnia " +
                    "and Herzegovina',22,'Босния и Герцеговина'),('Botswana',23,'Ботсвана'),('Brazil',24,'Бразилия')," +
                    "('Brunei',25,'Бруней'),('Bulgaria',26,'Болгария'),('Burkina Faso',27,'Буркина-Фасо'),('Burundi',28," +
                    "'Бурунди'),('Côte d\\'Ivoire',29,'Берег Слоновой Кости'),('Cabo Verde',30,'Кабо-Верде'),('Cambodia'," +
                    "31,'Камбоджа'),('Cameroon',32,'Камерун'),('Canada',33,'Канада'),('Central African Republic',34," +
                    "'Центрально-Африканская Республика'),('Chad',35,'Чад'),('Chile',36,'Чили'),('China',37,'Китай')," +
                    "('Colombia',38,'Колумбия'),('Comoros',39,'Коморские острова'),('Congo (Congo-Brazzaville)',40,'Конго" +
                    " (Конго-Браззавиль)'),('Costa Rica',41,'Коста-Рика'),('Croatia',42,'Хорватия'),('Cuba',43,'Куба')," +
                    "('Cyprus',44,'Кипр'),('Czech Republic',45,'Чехия'),('Democratic Republic of the Congo',46," +
                    "'Демократическая Республика Конго'),('Denmark',47,'Дания'),('Djibouti',48,'Джибути'),('Dominica',49," +
                    "'Доминика'),('Dominican Republic',50,'Доминиканская Республика'),('Ecuador',51,'Эквадор'),('Egypt'," +
                    "52,'Египет'),('El Salvador',53,'Эль Сальвадор'),('Equatorial Guinea',54,'Экваториальная Гвинея')," +
                    "('Eritrea',55,'Эритрея'),('Estonia',56,'Эстония'),('Eswatini (fmr. \\\"Swaziland\\\")',57,'Эсватини " +
                    "(Свазиленд)'),('Ethiopia',58,'Эфиопия'),('Fiji',59,'Фиджи'),('Finland',60,'Финляндия'),('France',61," +
                    "'Франция'),('Gabon',62,'Габон'),('Gambia',63,'Гамбия'),('Georgia',64,'Грузия'),('Germany',65," +
                    "'Германия'),('Ghana',66,'Гана'),('Greece',67,'Греция'),('Grenada',68,'Гренада'),('Guatemala',69," +
                    "'Гватемала'),('Guinea',70,'Гвинея'),('Guinea-Bissau',71,'Гвинея-Бисау'),('Guyana',72,'Гайана')," +
                    "('Haiti',73,'Гаити'),('Holy See',74,'Ватикан'),('Honduras',75,'Гондурас'),('Hungary',76,'Венгрия')," +
                    "('Iceland',77,'Исландия'),('India',78,'Индия'),('Indonesia',79,'Индонезия'),('Iran',80,'Иран')," +
                    "('Iraq',81,'Ирак'),('Ireland',82,'Ирландия'),('Israel',83,'Израиль'),('Italy',84,'Италия')," +
                    "('Jamaica',85,'Ямайка'),('Japan',86,'Япония'),('Jordan',87,'Иордания'),('Kazakhstan',88,'Казахстан')" +
                    ",('Kenya',89,'Кения'),('Kiribati',90,'Кирибати'),('Kosovo',91,'Косово'),('Kuwait',92,'Кувейт')," +
                    "('Kyrgyzstan',93,'Кыргызстан'),('Laos',94,'Лаос'),('Latvia',95,'Латвия'),('Lebanon',96,'Ливан')," +
                    "('Lesotho',97,'Лесото'),('Liberia',98,'Либерия'),('Libya',99,'Ливия'),('Liechtenstein',100," +
                    "'Лихтенштейн'),('Lithuania',101,'Литва'),('Luxembourg',102,'Люксембург'),('Madagascar',103," +
                    "'Мадагаскар'),('Malawi',104,'Малави'),('Malaysia',105,'Малайзия'),('Maldives',106,'Мальдивы')," +
                    "('Mali',107,'Мали'),('Malta',108,'Мальта'),('Marshall Islands',109,'Маршалловы острова')," +
                    "('Mauritania',110,'Мавритания'),('Mauritius',111,'Маврикий'),('Mexico',112,'Мексика'),('Micronesia'," +
                    "113,'Микронезия'),('Moldova',114,'Молдова'),('Monaco',115,'Монако'),('Mongolia',116,'Монголия')," +
                    "('Montenegro',117,'Черногория'),('Morocco',118,'Марокко'),('Mozambique',119,'Мозамбик'),('Myanmar'," +
                    "120,'Мьянма'),('Namibia',121,'Намибия'),('Nauru',122,'Науру'),('Nepal',123,'Непал'),('Netherlands'," +
                    "124,'Нидерланды'),('New Zealand',125,'Новая Зеландия'),('Nicaragua',126,'Никарагуа'),('Niger',127," +
                    "'Нигер'),('Nigeria',128,'Нигерия'),('North Korea',129,'Северная Корея'),('North Macedonia',130," +
                    "'Северная Македония'),('Norway',131,'Норвегия'),('Oman',132,'Оман'),('Pakistan',133,'Пакистан')," +
                    "('Palau',134,'Палау'),('Palestine State',135,'Государство Палестина'),('Panama',136,'Панама')," +
                    "('Papua New Guinea',137,'Папуа - Новая Гвинея'),('Paraguay',138,'Парагвай'),('Peru',139,'Перу')," +
                    "('Philippines',140,'Филиппины'),('Poland',141,'Польша'),('Portugal',142,'Португалия'),('Qatar',143," +
                    "'Катар'),('Romania',144,'Румыния'),('Russia',145,'Россия'),('Rwanda',146,'Руанда'),('Saint Kitts and" +
                    " Nevis',147,'Сент-Китс и Невис'),('Saint Lucia',148,'Сент-Люсия'),('Saint Vincent and the " +
                    "Grenadines',149,'Святой Винсент и Гренадины'),('Samoa',150,'Самоа'),('San Marino',151,'Сан-Марино')," +
                    "('Sao Tome and Principe',152,'Сан-Томе и Принсипи'),('Saudi Arabia',153,'Саудовская Аравия')," +
                    "('Senegal',154,'Сенегал'),('Serbia',155,'Сербия'),('Seychelles',156,'Сейшельские острова'),('Sierra " +
                    "Leone',157,'Сьерра-Леоне'),('Singapore',158,'Сингапур'),('Slovakia',159,'Словакия'),('Slovenia',160," +
                    "'Словения'),('Solomon Islands',161,'Соломоновы острова'),('Somalia',162,'Сомали'),('South Africa'," +
                    "163,'Южная Африка'),('South Korea',164,'Южная Корея'),('South Sudan',165,'Южный Судан'),('Spain'," +
                    "166,'Испания'),('Sri Lanka',167,'Шри-Ланка'),('Sudan',168,'Судан'),('Suriname',169,'Суринам')," +
                    "('Sweden',170,'Швеция'),('Switzerland',171,'Швейцария'),('Syria',172,'Сирия'),('Taiwan',173," +
                    "'Тайвань'),('Tajikistan',174,'Таджикистан'),('Tanzania',175,'Танзания'),('Thailand',176,'Таиланд')," +
                    "('Timor-Leste',177,'Тимор-Лешти'),('Togo',178,'Того'),('Tonga',179,'Тонга'),('Trinidad and Tobago'," +
                    "180,'Тринидад и Тобаго'),('Tunisia',181,'Тунис'),('Turkey',182,'Турция'),('Turkmenistan',183," +
                    "'Туркменистан'),('Tuvalu',184,'Тувалу'),('Uganda',185,'Уганда'),('Ukraine',186,'Украина'),('United " +
                    "Arab Emirates',187,'ОАЭ'),('United Kingdom',188,'Великобритания'),('USA',189,'США'),('Uruguay',190," +
                    "'Уругвай'),('Uzbekistan',191,'Узбекистан'),('Vanuatu',192,'Вануату'),('Venezuela',193,'Венесуэла')," +
                    "('Vietnam',194,'Вьетнам'),('Yemen',195,'Йемен'),('Zambia',196,'Замбия'),('Zimbabwe',197,'Зимбабве');";
            PreparedStatement statement = connection.prepareStatement(query);
            statement.execute();
            stringMaker("Table 'countries' added");
        } catch (SQLException e) {
            stringMaker("Problem with default insertion of countries");
        }
    }

    public static void insertDefaultCurrencies(Connection connection) {
        try {
            String query = "INSERT INTO currencies\n" +
                    "VALUES (1,'Albania Lek','ALL','Lek',122.937,'Lek'),(2,'Afghanistan Afghani','AFN','؋\\r\\n',95" +
                    ".6779,'؋'),(3,'Argentina Peso','ARS','$',115.186,'$'),(4,'Aruba Guilder','AWG','ƒ',2.19357,'Afl" +
                    ".'),(5,'Australia Dollar','AUD','$',1.57441,'$'),(6,'Azerbaijan Manat','AZN','₼',2.0548,'₼'),(7," +
                    "'Bahamas Dollar','BSD','$',1.21869,'B$'),(8,'Barbados Dollar','BBD','$',2.46075,'Bds$'),(9," +
                    "'Belarus Ruble','BYN','Br',3.07294,'Br'),(10,'Belize Dollar','BZD','BZ$',2.45656,'BZ$'),(11," +
                    "'Bermuda Dollar','BMD','$',1.21865,'BD$'),(12,'Bolivia Bolíviano','BOB','$b',8.41523,'Bs'),(13," +
                    "'Bosnia and Herzegovina Convertible Mark','BAM','KM',1.95293,'KM'),(14,'Botswana Pula','BWP'," +
                    "'P',12.9239,'P'),(15,'Bulgaria Lev','BGN','лв',1.95434,'лв.'),(16,'Brazil Real','BRL','R$',6" +
                    ".44824,'R$'),(17,'Brunei Darussalam Dollar','BND','$',1.61231,'B$'),(18,'Cambodia Riel','KHR'," +
                    "'៛',4960.23,'៛'),(19,'Canada Dollar','CAD','$',1.47227,'CA$'),(20,'Cayman Islands Dollar','KYD'," +
                    "'$',1.01558,'CI$'),(21,'Chile Peso','CLP','$',891.195,'CLP$'),(22,'China Yuan Renminbi','CNY'," +
                    "'¥',7.77828,'元'),(23,'Colombia Peso','COP','$',4558.36,'COL$'),(24,'Costa Rica Colon','CRC','₡'," +
                    "753.235,'₡'),(25,'Croatia Kuna','HRK','kn',7.51639,'kn'),(26,'Cuba Peso','CUP','₱',32.2942," +
                    "'$MN'),(27,'Czech Republic Koruna','CZK','Kč',25.4401,'Kč'),(28,'Denmark Krone','DKK','kr',7" +
                    ".43673,'kr'),(29,'Dominican Republic Peso','DOP','RD$',69.2965,'RD$'),(30,'East Caribbean " +
                    "Dollar','XCD','$',3.29346,'EC$'),(31,'Egypt Pound','EGP','£',19.1068,'E£'),(32,'El Salvador " +
                    "Colon','SVC','₡',10.6632,'₡'),(33,'Euro','EUR','€',1,'€'),(34,'Falkland Islands Malvinas Pound'," +
                    "'FKP','£',0.867088,'FK£'),(35,'Fiji Dollar','FJD','$',2.46892,'FJ$'),(36,'Ghana Cedi','GHS','¢'," +
                    "7.07181,'GH₵'),(37,'Gibraltar Pound','GIP','£',0.867088,'£'),(38,'Guatemala Quetzal','GTQ','Q',9" +
                    ".41035,'Q'),(39,'Guernsey Pound','GGP','£',0.867088,'£'),(40,'Guyana Dollar','GYD','$',254.66," +
                    "'GY$'),(41,'Honduras Lempira','HNL','L',29.2833,'L'),(42,'Hong Kong Dollar','HKD','$',9.45909," +
                    "'HK$'),(43,'Hungary Forint','HUF','Ft',348.004,'Ft'),(44,'Iceland Krona','ISK','kr',146.872," +
                    "'kr'),(45,'India Rupee','INR','',88.4722,'₹'),(46,'Indonesia Rupiah','IDR','Rp',17435,'Rp'),(47," +
                    "'Iran Rial','IRR','\\'\t﷼\\'',51311.3,'﷼'),(48,'Isle of Man Pound','IMP','£',0.867088,'£'),(49," +
                    "'Israel Shekel','ILS','₪',3.95542,'₪'),(50,'Jamaica Dollar','JMD','J$',181.741,'J$'),(51,'Japan " +
                    "Yen','JPY','¥',133.342,'¥'),(52,'Jersey Pound','JEP','£',0.867088,'£'),(53,'Kazakhstan Tenge'," +
                    "'KZT','₸',522.912,'₸'),(54,'Korea North Won','KPW','₩',1096.79,'₩'),(55,'Korea South Won','KRW'," +
                    "'₩',1362.9,'₩'),(56,'Kyrgyzstan Som','KGS','С̲',101.614,'С̲'),(57,'Laos Kip','LAK','₭',11496.2," +
                    "'₭N'),(58,'Lebanon Pound','LBP','\\'\tل.ل.\\'',1838.06,'\\'\tل.ل.\\''),(59,'Liberia Dollar'," +
                    "'LRD','$',209.099,'LD$'),(60,'Macedonia Denar','MKD','ден',61.4198,'den'),(61,'Malaysia " +
                    "Ringgit','MYR','RM',5.04461,'RM'),(62,'Mauritius Rupee','MUR','₨',49.2946,'Rs'),(63,'Mexico " +
                    "Peso','MXN','$',24.2486,'Mex$'),(64,'Mongolia Tughrik','MNT','₮',3474.27,'₮'),(65,'Mozambique " +
                    "Metical','MZN','MT',74.0085,'MTn'),(66,'Namibia Dollar','NAD','$',16.7814,'N$'),(67,'Nepal " +
                    "Rupee','NPR','₨',141.478,'रू'),(68,'Netherlands Antilles Guilder','ANG','ƒ',2.18763,'NAƒ'),(69," +
                    "'New Zealand Dollar','NZD','$',1.67087,'NZ$'),(70,'Nicaragua Cordoba','NIO','C$',42.5634,'C$')," +
                    "(71,'Nigeria Naira','NGN','₦',502.73,'₦'),(72,'Norway Krone','NOK','kr',10.1866,'kr'),(73,'Oman " +
                    "Rial','OMR','\\'\tر.ع.\\'',0.469197,'\\'\tR.O\\''),(74,'Pakistan Rupee','PKR','₨',189.207,'₨')," +
                    "(75,'Panama Balboa','PAB','B/.',1.21869,'B/.'),(76,'Paraguay Guarani','PYG','Gs',8233.9,'₲')," +
                    "(77,'Peru Sol','PEN','S/.',4.69689,'S/'),(78,'Philippines Peso','PHP','₱',58.5281,'₱'),(79," +
                    "'Poland Zloty','PLN','zł',4.48579,'zł'),(80,'Qatar Riyal','QAR','ر.ق',4.43713,'QR'),(81,'Romania" +
                    " Leu','RON','lei',4.91567,'L'),(82,'Russia Ruble','RUB','₽',89.4587,'₽'),(83,'Saint Helena " +
                    "Pound','SHP','£',0.867088,'£'),(84,'Saudi Arabia Riyal','SAR','ر.س',4.57069,'ر.س'),(85,'Serbia " +
                    "Dinar','RSD','Дин.',117.433,'din'),(86,'Seychelles Rupee','SCR','SCR ',20.1041,'SR'),(87," +
                    "'Singapore Dollar','SGD','$',1.61358,'S$'),(88,'Solomon Islands Dollar','SBD','$',9.71427,'SI$')" +
                    ",(89,'Somalia Shilling','SOS','S',712.911,'Sh.So.'),(90,'South Africa Rand','ZAR','R',16.7487," +
                    "'R'),(91,'Sri Lanka Rupee','LKR','₨',241.917,'රු'),(92,'Sweden Krona','SEK','kr',10.1158,'kr')," +
                    "(93,'Switzerland Franc','CHF','CHF',1.09718,'SFr'),(94,'Suriname Dollar','SRD','$',17.2488," +
                    "'Sr$'),(95,'Syria Pound','SYP','£',1532.5,'LS'),(96,'Taiwan New Dollar','TWD','NT$',33.8748,'圓')" +
                    ",(97,'Thailand Baht','THB','฿',38.1561,'฿'),(98,'Trinidad and Tobago Dollar','TTD','TT$',8" +
                    ".27225,'TT$'),(99,'Turkey Lira','TRY','',10.3017,'TL'),(100,'Tuvalu Dollar','TVD','$',1.63218," +
                    "'TV$'),(101,'Ukraine Hryvnia','UAH','₴',33.546,'грн'),(102,'United Kingdom Pound\\r\\n','GBP'," +
                    "'£',0.860294,'£'),(103,'United States Dollar','USD','$',1.21865,'$'),(104,'Uruguay Peso','UYU'," +
                    "'$U',53.5694,'$U'),(105,'Uzbekistan Som','UZS','лв',12905.2,'лв'),(106,'Venezuela Bolívar'," +
                    "'VEF','Bs',260584000000,'Bs.S.'),(107,'Viet Nam Dong','VND','₫',28097.3,'₫'),(108,'Yemen Rial'," +
                    "'YER','ر.ي',304.662,'ر.ي'),(109,'Zimbabwe Dollar','ZWD','Z$',428.124,'Z$'),(110,'UAE Dirham'," +
                    "'AED',' ',4.47606,' '),(111,'Moroccan Dirham','MAD',' ',10.7745,'');";
            PreparedStatement statement = connection.prepareStatement(query);
            statement.execute();
            stringMaker("Table 'currencies' added");
        } catch (SQLException e) {
            stringMaker("Problem with default insertion of country");
        }
    }

    public static void insertDefaultLocationsOld(Connection connection) {
        try {
            String queryDrop = "DROP TABLE locations_old";
            PreparedStatement statement0 = connection.prepareStatement(queryDrop);
            statement0.execute();

            TablesInitializer.locationTableMakerAlt(connection);
            String query = "INSERT INTO locations\n" +
                    "VALUES (8,'Tehran',80,35.70,51.42,'Тегеран'),(9,'Tashkent',191,41.30,69.27,'Ташкент'),(10," +
                    "'Sanaa',195,15.35,44.20,'Санаа'),(11,'Phnom Penh',31,11.57,104.92,'Пномпень'),(12,'Naypyidaw'," +
                    "120,19.75,96.13,'Нейпьидо'),(13,'Muscat',132,23.61,58.59,'Маскат'),(14,'Manila',140,14.60,120" +
                    ".98,'Манила'),(15,'Male',106,4.18,73.51,'Мале'),(16,'Lhasa',37,29.65,91.10,'Лхаса'),(17,'Kuwait " +
                    "City',92,29.38,47.98,'Кувейт'),(18,'Kathmandu',123,27.72,85.37,'Катманду'),(19,'Kabul',1,34.53," +
                    "69.17,'Кабул'),(20,'Islamabad',133,33.70,73.04,'Исламабад'),(21,'Dushanbe',174,38.57,68.79," +
                    "'Душанбе'),(22,'Doha',143,25.30,51.53,'Доха'),(23,'Dhaka',14,23.72,90.40,'Дакка'),(24,'Colombo'," +
                    "167,6.92,79.83,'Коломбо'),(25,'Bishkek',93,42.87,74.57,'Бишкек'),(26,'Beirut',96,33.89,35.51," +
                    "'Бейрут'),(27,'Bandar Seri Begawan',25,4.92,114.92,'Бандар-Сери-Бегаван'),(28,'Baghdad',81,33" +
                    ".35,44.42,'Багдад'),(29,'Astana',88,51.13,71.43,'Астана'),(30,'Ashgabat',183,37.95,58.38," +
                    "'Ашхабад'),(31,'Amman',87,31.95,35.93,'Амман'),(32,'Manama',13,26.22,50.58,'Манама'),(33," +
                    "'Tbilisi',64,41.72,44.79,'Тбилиси'),(34,'Baku',11,40.37,49.84,'Баку'),(35,'Yerevan',8,40.18,44" +
                    ".51,'Ереван'),(36,'Honolulu',189,21.33,-157.85,'Гонолулу'),(37,'San Francisco',189,37.76,-122" +
                    ".44,'Сан-Франциско'),(38,'Orlando',189,28.48,-81.34,'Орландо'),(39,'Las Vegas',189,36.23,-115" +
                    ".27,'Лас Вегас'),(40,'Los Angeles',189,34.11,-118.41,'Лос-Анджелес'),(41,'Miami',189,25.78,-80" +
                    ".21,'Майами'),(42,'New York',189,40.69,-73.92,'Нью-Йорк'),(43,'Johannesburg',163,-26.20,28.04," +
                    "'Йоханнесбург'),(44,'Dammam',153,26.43,50.10,'Даммам'),(45,'Riyadh',153,24.65,46.71,'Эр-Рияд')," +
                    "(47,'Cancun',112,21.16,-86.85,'Канкун'),(48,'Fukuoka',86,33.59,130.40,'Фукуока'),(49,'Chiba',86," +
                    "35.60,140.10,'Чиба'),(50,'Kyoto',86,35.01,135.77,'Киото'),(51,'Osaka',86,34.69,135.50,'Осака')," +
                    "(52,'Jerusalem',83,31.78,35.22,'Иерусалим'),(53,'Batam',79,1.11,104.04,'Батам'),(55,'Kolkatta'," +
                    "78,22.54,88.34,'Калькутта'),(56,'Jaipur',78,26.92,75.87,'Джайпур'),(57,'Chennai',78,13.08,80.28," +
                    "'Ченнаи'),(58,'Hurgada',52,27.22,33.83,'Хургада'),(59,'Beijing',37,39.91,116.39,'Пекин'),(60," +
                    "'Zhuhai',37,22.28,113.57,'Чжухай'),(61,'Guilin',37,25.27,110.28,'Гуйлинь'),(62,'Vancouver',33,49" +
                    ".25,-123.10,'Ванкувер'),(63,'Toronto',33,43.74,-79.37,'Торонто'),(64,'Rio de Janeiro',24,-22.91," +
                    "-43.20,'Рио де Жанейро'),(65,'Buenos Aires',7,-34.60,-58.38,'Буэнос айрес'),(66,'Bangalore',78," +
                    "12.97,77.60,'Бангалор'),(67,'Krabi',176,8.06,98.92,'Краби'),(68,'Jeju',164,33.51,126.52,'Чеджу')" +
                    ",(69,'Abu Dhabi',187,24.48,54.37,'Абу Даби'),(70,'Auckland',125,-36.85,174.78,'Окленд'),(71," +
                    "'Cebu',140,10.30,123.90,'Себу'),(72,'Sydney',9,-33.87,151.21,'Сидней'),(73,'Melbourne',9,-37.81," +
                    "144.96,'Мельбурн'),(74,'Marrakech',118,31.63,-7.98,'Марракеш'),(75,'Penang Island',105,5.38,100" +
                    ".25,'Остров Пенанг'),(76,'Jakarta',79,-6.21,106.85,'Джакарта'),(77,'Ha Noi',194,21.03,105.85," +
                    "'Ханой'),(78,'Cairo',52,30.06,31.24,'Каир'),(79,'Johor Bahru',105,1.46,103.76,'Джохор-Бару')," +
                    "(80,'Denpasar',79,-8.67,115.22,'Денпасар'),(81,'Ho Chi Minh',194,10.78,106.70,'Хо Ши Мин'),(82," +
                    "'Shanghai',37,31.17,121.47,'Шанхай'),(83,'Seoul',164,37.58,127.00,'Сеул'),(84,'Medina',153,24" +
                    ".47,39.60,'Медина'),(85,'Guangzhou',37,23.13,113.26,'Гуанчжоу'),(86,'Mecca',153,21.42,39.83," +
                    "'Мекка'),(87,'Taipei',173,25.05,121.53,'Тайбэй'),(88,'Pattaya',176,12.93,100.90,'Паттайя'),(89," +
                    "'Tokyo',86,35.69,139.69,'Токио'),(90,'Phuket',176,7.89,98.40,'Пхукет'),(91,'Mumbai',78,18.97,72" +
                    ".83,'Мумбаи'),(92,'Shenzhen',37,22.54,114.05,'Шэньчжэнь'),(93,'Delhi',78,28.66,77.23,'Дели')," +
                    "(94,'Kuala Lumpur',105,3.15,101.70,'Куала Лумпур'),(95,'Dubai',187,25.27,55.31,'Дубай'),(96," +
                    "'Singapore',158,1.30,103.80,'Сингапур'),(97,'Macau',37,22.20,113.55,'Макао'),(98,'Bangkok',176," +
                    "13.75,100.52,'Бангкок'),(99,'Hong Kong',37,22.31,114.19,'Гонконг'),(100,'Antwerp',17,51.22,4.40," +
                    "'Антверпен'),(101,'Aberdeen',188,57.15,-2.11,'Абердин'),(102,'Augsburg',65,48.37,10.90," +
                    "'Аугсбург'),(103,'Alexandroupolis',67,40.85,25.87,'Александруполис'),(104,'Athens',67,37.98,23" +
                    ".72,'Афины'),(105,'Alicante',166,38.35,-0.48,'Аликанте'),(106,'Almeria',166,36.84,-2.46," +
                    "'Альмерия'),(107,'Aalborg',47,57.03,9.92,'Ольборг'),(108,'Aarhus',47,56.16,10.21,'Орхус'),(109," +
                    "'Ancona',84,43.62,13.52,'Анкона'),(110,'Aosta',84,45.74,7.32,'Аоста'),(111,'Amsterdam',124,52" +
                    ".35,4.92,'Амстердам'),(112,'Alanya',182,36.54,32.00,'Аланья'),(113,'Ankara',182,39.93,32.85," +
                    "'Анкара'),(114,'Antalya',182,36.91,30.70,'Анталия'),(115,'Altenrhein',171,47.49,9.55," +
                    "'Альтенрайн'),(116,'Brussels',17,50.85,4.35,'Брюссель'),(117,'Burgas',26,42.50,27.47,'Бургас')," +
                    "(118,'Banja Luka',22,44.77,17.18,'Баня-Лука'),(119,'Belfast',188,54.60,-5.93,'Белфаст'),(120," +
                    "'Birmingham',188,52.48,-1.90,'Бирмингем'),(121,'Bournemouth',188,50.72,-1.88,'Борнмут'),(122," +
                    "'Bristol',188,51.45,-2.58,'Бристоль'),(123,'Budapest',76,47.50,19.04,'Будапешт'),(124,'Berlin'," +
                    "65,52.52,13.38,'Берлин'),(126,'Bremen',65,53.12,8.80,'Бремен'),(127,'Billund',47,55.73,9.12," +
                    "'Биллунд'),(128,'Barcelona',166,41.38,2.18,'Барселона'),(129,'Bilbao',166,43.26,-2.95,'Бильбао')" +
                    ",(130,'Bologna',84,44.49,11.34,'Болонья'),(131,'Bergen',131,60.39,5.32,'Берген'),(132,'Bodo'," +
                    "131,67.28,14.38,'Бодо'),(134,'Bucharest',144,44.40,26.08,'Бухарест'),(135,'Belgrade',155,44.82," +
                    "20.47,'Белград'),(136,'Bratislava',159,48.14,17.11,'Братислава'),(137,'Bordeaux',61,44.84,-0.58," +
                    "'Бордо'),(139,'Brno',45,49.20,16.61,'Брно'),(140,'Basel',171,47.56,7.59,'Базель'),(141,'Bern'," +
                    "171,46.95,7.45,'Берн'),(142,'Cardiff',188,51.48,-3.18,'Кардифф'),(143,'Cambridge',188,43.40,-80" +
                    ".31,'Кембридж'),(144,'Coventry',188,52.41,-1.51,'Ковентри'),(145,'Cologne',65,50.94,6.96," +
                    "'Кёльн'),(146,'Corfu',67,39.59,19.86,'Корфу'),(147,'Copenhagen',47,55.68,12.56,'Копенгаген')," +
                    "(150,'Cork',82,51.90,-8.47,'Корк'),(151,'Cagliari',84,39.22,9.10,'Кальяри'),(152,'Catania',84,37" +
                    ".50,15.09,'Катания'),(153,'Cluj-Napoca',144,46.78,23.56,'Клуж-Напока'),(154,'Clermont-Ferrand'," +
                    "61,45.78,3.08,'Клермон-Ферран'),(155,'Chambery-Savoie',61,45.57,5.91,'Шамбери-Савойя'),(156," +
                    "'Cherbourg',61,49.65,-1.65,'Шербур'),(158,'Doncaster',188,53.52,-1.13,'Донкастер'),(159," +
                    "'Dortmund',65,51.51,7.47,'Дортмунд'),(160,'Dresden',65,51.05,13.74,'Дрезден'),(161," +
                    "'Duesseldorf',65,51.23,6.78,'Дюссельдорф'),(162,'Dublin',82,53.34,-6.27,'Дублин'),(163," +
                    "'Dalaman',182,36.81,28.88,'Даламан'),(164,'Dubrovnik',42,42.64,18.11,'Дубровник'),(165,'East " +
                    "Midlands',188,52.80,-0.67,'Ист-Мидлендс'),(166,'Edinburgh',188,55.95,-3.19,'Эдинбург'),(167," +
                    "'Exeter',188,50.72,-3.53,'Эксетер'),(169,'Esbjerg',47,55.47,8.45,'Эсбьерг'),(171,'Eilat',83,29" +
                    ".56,34.95,'Эйлат'),(172,'Eindhoven',124,51.43,5.50,'Эйндховен'),(174,'Frankfurt',65,50.11,8.68," +
                    "'Франкфурт'),(175,'Friedrichshafen',65,47.65,9.48,'Фридрихсхафен'),(176,'Fuerteventura',166,28" +
                    ".40,-14.00,'Фуэртевентура'),(177,'Florence',84,43.77,11.25,'Флоренция'),(178,'Floro',131,61.60,5" +
                    ".02,'Флоро'),(179,'Faro',142,37.02,-7.93,'Фаро'),(180,'Funchal',142,32.65,-16.92,'Фуншал'),(181," +
                    "'Graz',10,47.07,15.43,'Грац'),(182,'Gorna Oryahovitsa',26,43.12,25.69,'Горна Оряховица'),(183," +
                    "'Guernsey',188,57.17,-7.37,'Гернси'),(184,'Glasgow',188,55.86,-4.25,'Глазго'),(185," +
                    "'Gloucestershire',188,51.76,-2.19,'Глостершир'),(186,'Granada',166,37.18,-3.60,'Гранада'),(187," +
                    "'Girona',166,41.98,2.82,'Жирона'),(188,'Galway',82,53.27,-9.04,'Голуэй'),(189,'Genoa',84,44.41,8" +
                    ".93,'Генуя'),(190,'Groningen',124,53.22,6.58,'Гронинген'),(191,'Gdansk',141,54.37,18.63," +
                    "'Гданьск'),(192,'Geneva',171,46.20,6.15,'Женева'),(193,'Gothenburg',170,57.67,11.98,'Гетеборг')," +
                    "(194,'Humberside',188,53.57,-0.35,'Хамберсайд'),(196,'Hamburg',65,53.55,10.00,'Гамбург'),(197," +
                    "'Hannover',65,52.37,9.74,'Ганновер'),(200,'Heraklion',67,35.34,25.13,'Ираклион'),(201," +
                    "'Helsinki',60,60.18,24.93,'Хельсинки'),(202,'Innsbruck',10,47.27,11.39,'Инсбрук'),(203," +
                    "'Inverness',188,57.48,-4.22,'Инвернесс'),(204,'Debrecen',76,47.53,21.64,'Дебрецен'),(205," +
                    "'Ibiza',166,38.91,1.43,'Ибица'),(206,'Izmir',182,38.41,27.14,'Измир'),(207,'Istanbul',182,41.01," +
                    "28.96,'Стамбул'),(208,'Jonkoping',170,57.78,14.17,'Йёнчёпинг'),(209,'Klagenfurt',10,46.62,14.30," +
                    "'Клагенфурт'),(210,'Karlsruhe',65,49.02,8.40,'Карлсруэ'),(211,'Kortrijk',17,50.83,3.27," +
                    "'Кортрейк'),(212,'Kaunas',101,54.90,23.93,'Каунас'),(213,'Katowice',141,50.25,19.00,'Катовице')," +
                    "(214,'Krakow',141,50.06,19.94,'Краков'),(215,'Kosice',159,48.72,21.25,'Кошице'),(216,'Karlovy " +
                    "Vary',45,50.23,12.87,'Карловы Вары'),(217,'Karlstad',170,59.37,13.50,'Карлстад'),(218," +
                    "'Kuressaare',56,58.25,22.49,'Курессааре'),(219,'Linz',10,48.30,14.28,'Линц'),(220,'Liege',17,50" +
                    ".63,5.59,'Льеж'),(221,'Lands End',188,50.07,-5.71,'Лендс-Энд'),(222,'Liverpool',188,53.40,-2.98," +
                    "'Ливерпуль'),(223,'Lydd',188,50.95,0.91,'Лидд'),(224,'Leeds',188,53.80,-1.55,'Лидс'),(225," +
                    "'London',188,51.51,-0.13,'Лондон'),(226,'Luebeck',65,53.87,10.68,'Любек'),(227,'Lanzarote',166," +
                    "29.01,-13.63,'Лансароте'),(228,'Las Palmas de Gran Canaria',166,28.10,-15.41," +
                    "'Лас-Пальмас-де-Гран-Канария'),(230,'Lamezia Terme',84,38.96,16.30,'Ламеция Терме'),(231," +
                    "'Larnaca',44,34.92,33.63,'Ларнака'),(232,'Liepaja',95,56.51,21.01,'Лиепая'),(233,'Luxembourg'," +
                    "102,49.61,6.13,'Люксембург'),(235,'Lisbon',142,38.75,-9.16,'Лиссабон'),(236,'Ljubljana',160,46" +
                    ".05,14.52,'Любляна'),(237,'Lappeenranta',60,61.06,28.19,'Лаппеенранта'),(238,'Le Touquet',61,43" +
                    ".87,0.30,'Ле-Туке-Пари-Плаж'),(239,'Lille',61,50.63,3.06,'Лилль'),(240,'Lyon',61,45.76,4.84," +
                    "'Лион'),(241,'Lugano',171,46.01,8.96,'Лугано'),(242,'Lulea',170,65.58,22.15,'Лулео'),(243," +
                    "'Manchester',188,53.48,-2.25,'Манчестер'),(244,'Mannheim',65,49.49,8.47,'Мангейм'),(245," +
                    "'Memmingen',65,47.99,10.18,'Мемминген'),(246,'Muenster',65,51.96,7.63,'Мюнстер'),(247,'Munich'," +
                    "65,48.14,11.58,'Мюнхен'),(248,'Madrid',166,40.42,-3.69,'Мадрид'),(249,'Malaga',166,36.72,-4.42," +
                    "'Малага'),(250,'Mahon',82,51.89,-8.40,'Махон'),(251,'Murcia',166,37.99,-1.14,'Мурсия'),(252," +
                    "'Milan',84,45.47,9.19,'Милан'),(253,'Malta',108,42.99,-73.79,'Мальта'),(254,'Monte Carlo',115,43" +
                    ".74,7.43,'Монте-Карло'),(255,'Maastricht',124,50.85,5.68,'Маастрихт'),(257,'Milas',182,37.27,27" +
                    ".81,'Милас'),(259,'Marseille',61,43.30,5.37,'Марсель'),(260,'Metz',61,49.12,6.18,'Мец'),(261," +
                    "'Montpellier',61,43.61,3.88,'Монпелье'),(262,'Malmo',170,55.61,13.00,'Мальме'),(263,'Norwich'," +
                    "188,52.63,1.30,'Норвич'),(264,'Newcastle',188,55.01,-1.66,'Ньюкасл'),(265,'Newquay',188,50.41,-5" +
                    ".08,'Ньюквей'),(266,'Nuremberg',65,49.45,11.08,'Нюрнберг'),(267,'Naples',84,40.83,14.25," +
                    "'Неаполь'),(268,'Constanta',144,44.17,28.64,'Констанца'),(269,'Nantes',61,47.22,-1.55,'Нант')," +
                    "(270,'Nice',61,43.70,7.27,'Ницца'),(271,'Norrkoping',170,58.59,16.19,'Норрчёпинг'),(272," +
                    "'Ostend',17,51.23,2.92,'Остенде'),(273,'Alderney',188,49.73,-2.23,'Олдерни'),(274,'Oviedo',166," +
                    "43.36,-5.84,'Овьедо'),(275,'Olbia',84,40.91,9.52,'Ольвия'),(276,'Ohrid',130,41.12,20.80,'Охрид')" +
                    ",(277,'Oslo',131,59.91,10.75,'Осло'),(279,'Ostrava',45,49.84,18.29,'Острава'),(280,'Plovdiv',26," +
                    "42.14,24.75,'Пловдив'),(281,'Plymouth',188,50.37,-4.14,'Плимут'),(282,'Paderborn',65,51.72,8.77," +
                    "'Падерборн'),(283,'Rostock',65,54.08,12.13,'Росток'),(284,'Palma Majorca',166,39.57,2.65,'Пальма" +
                    " Майорка'),(285,'Palermo',84,38.12,13.36,'Палермо'),(286,'Pescara',84,42.46,14.21,'Пескара')," +
                    "(287,'Pisa',84,43.72,10.40,'Пиза'),(288,'Paphos',44,34.78,32.43,'Пафос'),(289,'Palanga',101,55" +
                    ".92,21.06,'Паланга'),(290,'Ponta Delgada',142,37.74,-25.67,'Понта-Делгада'),(291,'Porto',142,41" +
                    ".15,-8.61,'Порту'),(292,'Poprad',159,49.05,20.30,'Попрад'),(293,'Paris',61,48.86,2.35,'Париж')," +
                    "(294,'Pula',42,44.87,13.83,'Пула'),(295,'Podgorica',117,42.44,19.27,'Подгорица'),(296," +
                    "'Pardubice',45,50.04,15.78,'Пардубице'),(297,'Prague',45,50.08,14.42,'Прага'),(298,'Parnu',56,58" +
                    ".38,24.50,'Пярну'),(299,'Rhodes',67,36.44,28.22,'Родос'),(300,'Reykjavik',77,64.15,-21.94," +
                    "'Рейкьявик'),(301,'Reus',166,41.16,1.11,'Реус'),(302,'Rijeka',42,45.33,14.43,'Риека'),(303," +
                    "'Rome',84,41.89,12.48,'Рим'),(304,'Rimini',84,44.06,12.57,'Римини'),(305,'Riga',95,56.95,24.11," +
                    "'Рига'),(306,'Rotterdam',124,51.92,4.48,'Роттердам'),(307,'Ronneby',170,56.30,15.28,'Роннеби')," +
                    "(308,'Salzburg',10,47.80,13.05,'Зальцбург'),(309,'Sofia',26,42.70,23.32,'София'),(310," +
                    "'Sarajevo',22,43.87,18.42,'Сараево'),(311,'Southampton',188,50.90,-1.40,'Саутгемптон'),(312," +
                    "'Swansea',188,41.76,-71.21,'Суонси'),(313,'Shoreham',188,50.83,-0.27,'Шорхэм '),(314,'Poznan'," +
                    "141,52.40,16.92,'Познань'),(315,'Saarbruecken',65,49.23,7.00,'Саарбрюккен'),(316,'Stuttgart',65," +
                    "48.78,9.18,'Штутгарт'),(317,'Santorini',67,36.41,25.46,'Санторини'),(318,'Shannon',82,52.71,-8" +
                    ".87,'Шеннон'),(319,'Salamanca',166,20.57,-101.20,'Саламанка'),(320,'Santiago de Compostela',166," +
                    "42.88,-8.55,'Сантьяго-де-Компостела'),(321,'Sevilla',166,37.38,-5.97,'Севилья'),(322,'Siauliai'," +
                    "101,55.93,23.32,'Шяуляй'),(323,'Skopje',130,41.98,21.43,'Скопье'),(325,'Stavanger',131,58.97,5" +
                    ".73,'Ставангер'),(326,'Strasbourg',61,48.58,7.75,'Страсбург'),(327,'Split',42,43.51,16.45," +
                    "'Расколоть'),(328,'Sion',171,46.23,7.37,'Сион'),(329,'Stockholm',170,59.33,18.07,'Стокгольм')," +
                    "(330,'Tirana',2,41.33,19.82,'Тирана'),(331,'Thessaloniki',67,40.63,22.95,'Салоники'),(332," +
                    "'Tenerife',166,28.22,-16.59,'Тенерифе'),(333,'Treviso',84,45.67,12.24,'Тревизо'),(334,'Trieste'," +
                    "84,45.64,13.80,'Триест'),(335,'Turin',84,45.07,7.70,'Турин'),(336,'Tel-Aviv',83,32.08,34.80," +
                    "'Тель-Авив'),(337,'Terceira Island',142,38.72,-27.22,'Остров Терсейра'),(338,'Timisoara',144,45" +
                    ".76,21.23,'Тимишоара'),(339,'Trabzon',182,41.01,39.72,'Трабзон'),(340,'Tampere',60,61.50,23.76," +
                    "'Тампере'),(341,'Turku',60,60.45,22.27,'Турку'),(342,'Toulouse',61,43.60,1.44,'Тулуза'),(343," +
                    "'Tivat',117,42.43,18.70,'Тиват'),(344,'Trollhattan',170,58.28,12.29,'Тролльхеттан'),(345," +
                    "'Tallinn',56,59.44,24.75,'Таллинн'),(346,'Tartu',56,58.38,26.72,'Тарту'),(347,'Umea',170,63.83," +
                    "20.26,'Умео'),(348,'Vienna',10,48.21,16.37,'Вена'),(349,'Varna',26,43.21,27.92,'Варна'),(351," +
                    "'Valencia',166,10.17,-68.00,'Валенсия'),(352,'Valladolid',166,41.65,-4.73,'Вальядолид'),(353," +
                    "'Venice',84,45.44,12.33,'Венеция'),(354,'Verona',84,45.44,10.99,'Верона'),(355,'Ventspils',95,57" +
                    ".39,21.56,'Вентспилс'),(356,'Vilnius',101,54.68,25.28,'Вильнюс'),(357,'Iasi',144,47.16,27.59," +
                    "'Яссы'),(358,'Vaxjo',170,56.88,14.81,'Ваксьо'),(359,'Visby',170,57.63,18.31,'Висбй'),(361," +
                    "'Weeze',65,51.63,6.20,'Веце'),(362,'Westerland',65,54.91,8.31,'Вестерланд'),(363," +
                    "'Wilhelmshaven',65,53.52,8.13,'Вильгельмсхафен'),(364,'Warsaw',141,52.22,21.03,'Варшава'),(365," +
                    "'Wroclaw',141,51.11,17.04,'Вроцлав'),(366,'Zweibruecken',65,49.25,7.36,'Цвайбрюккен '),(367," +
                    "'Zaragoza',166,41.65,-0.88,'Сарагоса'),(368,'Zagreb',42,45.80,15.95,'Загреб'),(369,'Zadar',42,44" +
                    ".12,15.22,'Задар'),(370,'Zurich',171,47.37,8.54,'Цюрих'),(371,'Chisinau',114,47.01,28.86," +
                    "'Кишинёв'),(372,'Minsk',16,53.90,27.56,'Минск'),(373,'Gomel',16,52.44,30.98,'Гомель'),(374," +
                    "'Brest',16,52.08,23.66,'Брест'),(375,'Vitebsk',16,55.18,30.17,'Витебск'),(376,'Hrodna',16,53.67," +
                    "23.82,'Гродно'),(377,'Kiev',186,50.45,30.52,'Киев'),(378,'Kherson',186,46.63,32.60,'Херсон')," +
                    "(379,'Chernivtsi',186,48.29,25.93,'Черновцы'),(380,'Odesa',186,46.48,30.73,'Одесса'),(381," +
                    "'Zaporizhia',186,47.85,35.12,'Запорожье'),(382,'Vinnytsia',186,49.24,28.47,'Винница'),(383," +
                    "'Lviv',186,49.84,24.03,'Львов'),(384,'Dnipro',186,48.45,34.98,'Днепр'),(385,'Kharkiv',186,50.00," +
                    "36.23,'Харьков'),(386,'Ivano-Frankivsk',186,48.92,24.71,'Ивано-Франковск'),(387,'Moscow',145,55" +
                    ".76,37.62,'Москва'),(388,'Saint Petersburg',145,59.95,30.32,'Санкт-Петербург'),(389,'Sochi',145," +
                    "43.59,39.72,'Сочи'),(390,'Novosibirsk',145,55.03,82.92,'Новосибирск'),(391,'Ekaterinburg',145,56" +
                    ".84,60.61,'Екатеринбург'),(392,'Krasnodar',145,45.03,38.98,'Краснодар'),(393,'Anapa',145,44.89," +
                    "37.32,'Анапа'),(394,'Kaliningrad',145,54.72,20.50,'Калининград'),(395,'Platov',145,49.09,41.68," +
                    "'Платов'),(396,'Samara',145,53.18,50.12,'Самара'),(397,'Irkutsk',145,52.28,104.30,'Иркутск')," +
                    "(398,'Krasnoyarsk',145,56.02,92.87,'Красноярск'),(399,'Ufa',145,54.73,55.97,'Уфа'),(400,'Kazan'," +
                    "145,55.79,49.11,'Казань'),(401,'Mineralnye Vody',145,44.20,43.11,'Минеральные Воды'),(402," +
                    "'Tyumen',145,57.15,65.53,'Тюмень'),(403,'Khabarovsk',145,48.48,135.07,'Хабаровск'),(404," +
                    "'Surgut',145,61.25,73.43,'Сургут'),(405,'Vladivostok',145,43.12,131.90,'Владивосток'),(406," +
                    "'Yakutsk',145,62.03,129.73,'Якутск'),(407,'Perm',145,58.01,56.25,'Пермь'),(408,'Chelyabinsk'," +
                    "145,55.15,61.40,'Челябинск'),(409,'Novy Urengoy',145,66.09,76.70,'Новый Уренгой'),(410," +
                    "'Murmansk',145,68.97,33.08,'Мурманск'),(411,'Nizhniy Novgorod',145,56.33,44.01,'Нижний " +
                    "Новгород'),(412,'Volgograd',145,48.70,44.48,'Волгоград'),(413,'Yuzhno-Sakhalinsk',145,46.95,142" +
                    ".73,'Южно-Сахалинск'),(414,'Arkhangelsk',145,64.55,40.53,'Архангельск'),(415,'Omsk',145,54.97,73" +
                    ".38,'Омск'),(416,'Makhachkala',145,42.98,47.48,'Махачкала'),(417,'Gelendzik',145,44.56,38.08," +
                    "'Геленджик'),(418,'Petropavlovsk-Kamchatsky',145,53.02,158.65,'Петропавловск-Камчатский'),(419," +
                    "'Naberezhnye Chelny',145,55.70,52.33,'Набережные Челны'),(420,'Tomsk',145,56.49,84.95,'Томск')," +
                    "(421,'Nizhnevartovsk',145,60.94,76.60,'Нижневартовск'),(422,'Orenburg',145,51.77,55.10," +
                    "'Оренбург'),(423,'Voronezh',145,51.67,39.21,'Воронеж'),(424,'Syktyvkar',145,61.67,50.82," +
                    "'Сыктывкар'),(425,'Barnaul',145,53.36,83.79,'Барнаул'),(426,'Astrakhan',145,46.33,48.02," +
                    "'Астрахань'),(427,'Norilsk',145,69.33,88.22,'Норильск'),(428,'Belgorod',145,50.60,36.60," +
                    "'Белгород'),(429,'Salehard',145,66.53,66.63,'Салехард'),(430,'Chita',145,52.03,113.50,'Чита')," +
                    "(431,'Izhevsk',145,56.85,53.22,'Ижевск'),(432,'Khanty-Mansiysk',145,61.00,69.00," +
                    "'Ханты-Мансийск'),(433,'Saratov',145,51.53,46.00,'Саратов'),(434,'Stavropol',145,45.05,41.98," +
                    "'Ставрополь'),(437,'Kemerovo',145,55.33,86.07,'Кемерово'),(438,'Abakan',145,53.72,91.42," +
                    "'Абакан'),(439,'Grozny',145,43.31,45.70,'Грозный'),(441,'Vladikavkaz',145,43.02,44.65," +
                    "'Владикавказ'),(442,'Ulyanovsk',145,54.32,48.37,'Ульяновск'),(444,'Penza',145,53.20,45.00," +
                    "'Пенза'),(445,'Saransk',145,54.18,45.18,'Саранск'),(446,'Nadym',145,65.53,72.52,'Надым'),(447," +
                    "'Magnitogorsk',145,53.38,59.03,'Магнитогорск'),(448,'Rostov on Don',145,47.23,39.72,'Ростов на " +
                    "Дону'),(449,'Cheboksary',145,56.13,47.25,'Чебоксары'),(451,'Nalchik',145,43.48,43.62,'Нальчик')," +
                    "(452,'Cherepovets',145,59.13,37.92,'Череповец'),(453,'Magas',145,43.17,44.82,'Магас'),(454," +
                    "'Kirov',145,58.60,49.65,'Киров'),(455,'Naryan-Mar',145,67.64,53.01,'Нарьян-Мар'),(456,'Bratsk'," +
                    "145,56.17,101.62,'Братск'),(457,'Elista',145,46.32,44.27,'Элиста'),(458,'Gorno-Altaysk',145,51" +
                    ".96,85.96,'Горно-Алтайск'),(460,'Tambov',145,52.72,41.43,'Тамбов'),(461,'Vorkuta',145,67.50,64" +
                    ".03,'Воркута'),(462,'Neryungri',145,56.66,124.73,'Нерюнгри'),(463,'Ivanovo',145,57.00,41.00," +
                    "'Иваново'),(464,'Anadyr',145,64.73,177.52,'Анадырь'),(465,'Kursk',145,51.74,36.19,'Курск'),(466," +
                    "'Kogalym',145,62.27,74.49,'Когалым'),(467,'Kurgan',145,55.44,65.34,'Курган'),(468," +
                    "'Petrozavodsk',145,61.78,34.35,'Петрозаводск'),(469,'Orsk',145,51.21,58.54,'Орск'),(471," +
                    "'Kaluga',145,54.53,36.27,'Калуга'),(472,'Okha',145,53.58,142.93,'Оха'),(473,'Briansk',145,53.24," +
                    "34.37,'Брянск'),(475,'Kyzyl',145,51.72,94.45,'Кызыл'),(476,'Tiksi',145,71.63,128.84,'Тикси')," +
                    "(477,'Yaroslavl',145,57.62,39.85,'Ярославль'),(478,'Pevek',145,69.70,170.32,'Певек'),(480," +
                    "'Velikij Ustyug',145,60.76,46.30,'Великий Устюг'),(481,'Aldan',145,58.60,125.38,'Алдан'),(483," +
                    "'Beloyarsky',145,63.72,66.67,'Белоярский'),(484,'Bodaybo',145,57.85,114.19,'Бодайбо'),(485," +
                    "'Ust-Kut',145,56.78,105.75,'Усть-Кут'),(486,'Usinsk',145,66.00,57.54,'Усинск'),(487,'Nyagan'," +
                    "145,62.13,65.38,'Нягань'),(489,'Lensk',145,60.72,114.90,'Ленск'),(490,'Batagay',145,67.66,134" +
                    ".64,'Батагай'),(491,'Uraj',145,60.13,64.78,'Урай'),(492,'Nikolaevsk-na-Amure',145,53.15,140.73," +
                    "'Николаевск-на-Амуре'),(493,'Berezovo',145,54.09,39.30,'Березово'),(494,'Bugulma',145,54.53,52" +
                    ".78,'Бугульма'),(498,'Belaya Gora',145,68.54,146.19,'Белая Гора'),(499,'Mendeleyevo',145,56.04," +
                    "37.23,'Менделеево'),(501,'Lipetsk',145,52.62,39.60,'Липецк'),(502,'Nyurba',145,63.28,118.33," +
                    "'Нюрба'),(504,'Ust-Maya',145,60.46,134.54,'Усть-Майя'),(505,'Iturup',145,44.99,147.84,'Итуруп')," +
                    "(507,'Keperveyem',145,67.84,166.14,'Кепервеем'),(508,'Deputatsky',145,69.34,139.95," +
                    "'Депутатский'),(510,'Ust-Nera',145,64.57,143.20,'Усть-Нера'),(512,'Terney',145,45.05,136.61," +
                    "'Терней'),(513,'Olenyok',145,68.53,112.45,'Оленек'),(514,'Cherskiy',145,68.75,161.33,'Черский')," +
                    "(515,'Kavalerovo',145,44.27,135.05,'Кавалерово'),(516,'Igarka',145,67.47,86.57,'Игарка'),(517," +
                    "'Igrim',145,63.19,64.42,'Игрим'),(519,'Ust-Kuyga',145,70.00,135.55,'Усть-Куйга'),(520,'Hatanga'," +
                    "145,72.04,102.47,'Хатанга'),(521,'Dalnegorsk',145,44.55,135.57,'Дальнегорск'),(522,'Nogliki'," +
                    "145,51.83,143.17,'Ноглики'),(523,'Chokurdah',145,70.62,147.89,'Чокурдах'),(526,'Tynda',145,55" +
                    ".15,124.72,'Тында'),(528,'Podkamennaya Tunguska',145,61.60,90.12,'Подкаменная Тунгуска'),(529," +
                    "'Zhigansk',145,66.77,123.37,'Жиганск'),(530,'Dikson',145,73.51,80.55,'Диксон'),(531," +
                    "'Verkhnevilyuysk',145,63.45,120.32,'Верхневилюйск'),(532,'Vilyuysk',145,63.75,121.62,'Вилюйск')," +
                    "(533,'Dalnerechensk',145,45.93,133.73,'Дальнереченск'),(534,'Svetlaya',145,65.22,41.01," +
                    "'Светлая'),(535,'Komsomolsk Na Amure',145,50.55,137.02,'Комсомольск на Амуре'),(538,'Plastun'," +
                    "145,44.76,136.29,'Пластун'),(539,'Kotlas',145,61.25,46.65,'Котлас'),(540,'Gagra',64,43.28,40.27," +
                    "'Гагра'),(541,'New Athos',64,43.09,40.81,'Новый Афон'),(542,'Sukhumi',64,43.00,41.00,'Сухуми')," +
                    "(543,'Ukhta',145,63.57,53.70,'Ухта'),(545,'Donetsk',186,48.00,37.78,'Донецк'),(546,'Pristina'," +
                    "91,42.67,21.17,'Приштина'),(547,'Thimphu',20,27.48,89.63,'Тхимпху'),(548,'Ulaanbaatar',116,47" +
                    ".92,106.92,'Улан-Батор'),(550,'Agartala',78,23.83,91.27,'Агартала'),(551,'Agra',78,27.18,78.02," +
                    "'Агра'),(552,'Ahmedabad',78,23.03,72.58,'Ахмадабад'),(553,'Aizawl',78,23.71,92.72,'Айзавл')," +
                    "(554,'Allahabad',78,25.46,81.84,'Аллахабад'),(555,'Amritsar',78,31.62,74.85,'Амритсар'),(556," +
                    "'Aurangabad',78,19.88,75.32,'Аурангабад'),(557,'Bagdogra',78,26.70,88.32,'Багдогра'),(558," +
                    "'Belgaum',78,15.87,74.50,'Белгаум'),(560,'Bhavnagar',78,21.77,72.14,'Бхавнагар'),(561,'Bhopal'," +
                    "78,23.25,77.42,'Бхопал'),(562,'Bhubaneswar',78,20.27,85.84,'Бхубанешвар'),(563,'Bhuj',78,23.25," +
                    "69.81,'Бхудж'),(564,'Bikaner',78,28.02,73.32,'Биканер'),(565,'Chandigarh',78,30.74,76.79," +
                    "'Чандигарх'),(566,'Coimbatore',78,11.00,76.97,'Коимбатур'),(567,'Dehradun',78,30.32,78.03," +
                    "'Дехрадун'),(568,'Dharamsala',78,32.22,76.32,'Дхарамсала'),(569,'Dibrugarh',78,27.48,95.00," +
                    "'Дибругарх'),(570,'Dimapur',78,25.91,93.73,'Димапур'),(571,'Diu',78,20.72,70.99,'Диу'),(572," +
                    "'Gaya',78,24.75,85.02,'Гая'),(573,'Chicalim',78,15.39,73.86,'Чикалим'),(574,'Gorakhpur',78,26" +
                    ".76,83.37,'Горакхпур'),(575,'Guwahati',78,26.17,91.77,'Гувахати'),(576,'Gwalior',78,26.22,78.19," +
                    "'Гвалиор'),(577,'Hubli',78,15.36,75.13,'Хубли-Дхарвад'),(578,'Hyderabad ',78,17.37,78.47," +
                    "'Хайдарабад'),(579,'Imphal',78,24.82,93.95,'Импхал'),(580,'Indore',78,22.72,75.85,'Индор'),(581," +
                    "'Jabalpur',78,23.17,79.93,'Джабалпур'),(582,'Jaisalmer',78,26.92,70.92,'Джайсалмер'),(583," +
                    "'Jalgaon',78,21.02,75.57,'Джалгаон'),(584,'Jammu',78,32.73,74.85,'Джамму'),(585,'Jamnagar',78,22" +
                    ".47,70.07,'Джамнагар'),(586,'Jodhpur',78,26.29,73.02,'Джодхпур'),(587,'Jorhat',78,26.75,94.22," +
                    "'Джорхат'),(588,'Kadapa',78,14.48,78.82,'Кадапа'),(589,'Kandla',78,32.69,76.07,'Кандла'),(590," +
                    "'Kanpur',78,26.46,80.32,'Канпур'),(591,'Kazi Nazrul Islam',78,23.62,87.24,'Кази Назрул Ислам')," +
                    "(592,'Khajuraho',78,24.85,79.93,'Кхаджурахо'),(593,'Kochi ',78,9.97,76.28,'Кочи'),(594," +
                    "'Kolhapur',78,16.70,74.23,'Колхапур'),(595,'Kozhikode',78,11.26,75.78,'Кожикоде'),(596,'Kulu'," +
                    "78,31.96,77.10,'Кулу'),(597,'Leh',78,34.16,77.58,'Лех'),(599,'Lucknow',78,26.85,80.95,'Лакхнау')" +
                    ",(600,'Ludhiana',78,30.91,75.85,'Лудхияна'),(601,'Madurai',78,9.92,78.12,'Мадурай'),(602," +
                    "'Mangalore',78,12.87,74.88,'Мангалор'),(603,'Mysore',78,12.31,76.65,'Майсур'),(604,'Nagpur',78," +
                    "21.15,79.08,'Нагпур'),(605,'Nanded',78,19.15,77.33,'Нандед'),(606,'Nasik',78,20.00,73.78," +
                    "'Насик'),(607,'Pantnagar',78,29.03,79.49,'Пантнагар'),(608,'Pasighat',78,28.06,95.33,'Пасигхат')" +
                    ",(609,'Patna',78,25.61,85.14,'Патна'),(610,'Porbandar',78,21.64,69.60,'Порбандар'),(611,'Port " +
                    "blair',78,11.67,92.75,'Порт-Блэр'),(612,'Puducherry',78,11.93,79.83,'Пудучерри'),(613,'Pune',78," +
                    "18.52,73.86,'Пуна'),(614,'Raipur',78,21.24,81.63,'Райпур'),(615,'Rajahmundry',78,16.98,81.78," +
                    "'Раджамандри'),(616,'Rajkot',78,22.30,70.80,'Раджкот'),(617,'Ranchi',78,23.36,85.33,'Ранчи')," +
                    "(618,'Salem ',78,11.65,78.17,'Салем'),(619,'Shillong',78,25.57,91.88,'Шиллонг'),(620,'Shimla'," +
                    "78,31.10,77.17,'Шимла'),(621,'Shirdi',78,24.79,92.79,'Ширди'),(622,'Silchar',78,24.79,92.79," +
                    "'Силчар'),(623,'Srinagar',78,34.09,74.81,'Сринагар'),(624,'Surat',78,21.17,72.83,'Сурат'),(625," +
                    "'Tezpur',78,26.63,92.80,'Тезпу'),(626,'Thiruvananthapuram',78,8.50,76.90,'Тируванантапурам')," +
                    "(627,'Tiruchirapalli',78,10.76,78.71,'Тиручирапалли'),(628,'Tirupati',78,13.65,79.42,'Тирупати')" +
                    ",(629,'Tuticorin',78,8.78,78.13,'Тутикорин'),(630,'Udaipur',78,24.58,73.68,'Удайпур'),(631," +
                    "'Vadodara',78,22.30,73.20,'Вадодара'),(632,'Varanasi',78,25.32,83.01,'Варанаси'),(633," +
                    "'Vidyanagar',78,15.36,75.13,'Видьянагар'),(634,'Vijayawada',78,16.51,80.62,'Виджаявада'),(635," +
                    "'Visakhapatnam',78,17.73,83.32,'Вишакхапатнам'),(636,'Chiang Mai',176,18.79,98.99,'Чиангмай')," +
                    "(637,'Hat Yai',176,7.00,100.46,'Хат Яй'),(638,'Koh Samui',176,9.50,100.00,'Самуй'),(639,'Udon " +
                    "Thani',176,17.42,102.75,'Удонтхани'),(640,'Chiang Rai',176,19.91,99.83,'Чианг Рай'),(641,'Khon " +
                    "Kaen',176,16.43,102.83,'Хон Каен'),(642,'Surat Thani',176,9.14,99.33,'Сурат Тани'),(643,'Ubon " +
                    "Ratchathani',176,15.23,104.86,'Убонратчатхани'),(644,'Nakhon Si Thammarat',176,8.43,99.97," +
                    "'Накхонситхаммарат'),(645,'Phitsanulok',176,16.82,100.26,'Пхитсанулок'),(646,'Trang',176,7.56,99" +
                    ".61,'Транг'),(647,'Roi Et',176,16.06,103.65,'Рои Эт'),(648,'Nakhon Phanom',176,17.40,104.79," +
                    "'Накхон Пханом'),(649,'Buri Ram',176,15.00,103.11,'Бури Рам'),(650,'Sakon Nakhon',176,17.16,104" +
                    ".15,'Сакон Накхон'),(651,'Lampang',176,18.30,99.50,'Лампанг'),(652,'Mae Sot ',176,16.71,98.57," +
                    "'Мэй Сот'),(653,'Ranong',176,9.96,98.64,'Ранонг'),(654,'Chumphon',176,10.49,99.18,'Чумпхон')," +
                    "(655,'Loei',176,17.49,101.73,'Лоэ'),(656,'Narathiwat',176,6.43,101.82,'Наратхиват'),(657,'Trat'," +
                    "176,12.24,102.51,'Трат'),(658,'Phrae',176,18.14,100.14,'Пхрэ'),(659,'Sukhothai',176,17.01,99.82," +
                    "'Сукотаи'),(660,'Mae Hong Son',176,19.30,97.97,'Мэй Хонг Сон'),(661,'Hua Hin ',176,12.57,99.95," +
                    "'Хуа Хин'),(662,'Pai ',176,19.36,98.44,'Пай'),(663,'Chicago',189,41.84,-87.69,'Чикаго'),(664," +
                    "'Houston',189,29.79,-95.39,'Хьюстон'),(665,'Phoenix',189,33.57,-112.09,'Феникс'),(666," +
                    "'Philadelphia',189,40.01,-75.13,'Филадельфия'),(667,'San Antonio',189,29.47,-98.53,'Сан " +
                    "Антонио'),(668,'San Diego',189,32.83,-117.12,'Сан Диего'),(669,'Dallas',189,32.79,-96.77," +
                    "'Даллас'),(670,'San Jose',189,37.30,-121.85,'Сан - Хосе'),(671,'Austin',189,30.30,-97.75," +
                    "'Остин'),(672,'Fort Worth',189,32.78,-97.35,'Форт-Уэрт'),(673,'Jacksonville',189,30.33,-81.67," +
                    "'Джексонвилл'),(674,'Columbus',189,39.99,-82.99,'Колумбус'),(675,'Charlotte',189,35.21,-80.83," +
                    "'Шарлотта'),(676,'Indianapolis',189,39.78,-86.15,'Индианаполис'),(677,'Seattle',189,47.62,-122" +
                    ".32,'Сиэтл'),(678,'Denver',189,39.76,-104.88,'Денвер'),(679,'Washington',189,38.90,-77.02," +
                    "'Вашингтон'),(680,'Boston',189,42.32,-71.08,'Бостон'),(681,'El Paso',189,31.85,-106.43," +
                    "'Эль-Пасо'),(682,'Nashville',189,36.17,-86.78,'Нашвилл'),(683,'Detroit',189,42.38,-83.10," +
                    "'Детройт'),(684,'Portland',189,45.54,-122.65,'Портленд'),(685,'Oklahoma City',189,35.47,-97.51," +
                    "'Оклахома-Сити'),(686,'Memphis',189,35.10,-89.98,'Мемфис'),(687,'Louisville',189,38.17,-85.65," +
                    "'Луисвилл'),(688,'Baltimore',189,39.31,-76.61,'Балтимор'),(689,'Milwaukee',189,43.06,-87.97," +
                    "'Милуоки'),(690,'Albuquerque',189,35.11,-106.65,'Альбукерке'),(691,'Tucson',189,32.15,-110.88," +
                    "'Тусон'),(692,'Fresno',189,36.78,-119.79,'Фресно'),(693,'Mesa',189,33.40,-111.72,'Меса'),(694," +
                    "'Atlanta',189,33.76,-84.42,'Атланта'),(695,'Sacramento',189,38.57,-121.47,'Сакраменто'),(696," +
                    "'Kansas City',189,39.12,-94.55,'Канзас-Сити'),(697,'Colorado Springs',189,38.87,-104.76," +
                    "'Колорадо-Спрингс'),(698,'Raleigh',189,35.83,-78.64,'Роли'),(699,'Omaha',189,41.26,-96.05," +
                    "'Омаха'),(700,'Long Beach',189,33.80,-118.17,'Лонг-Бич'),(701,'Virginia Beach',189,36.73,-76.04," +
                    "'Вирджиния Бич'),(702,'Minneapolis',189,44.96,-93.27,'Миннеаполис'),(703,'Oakland',189,37.79," +
                    "-122.22,'Окленд Калифорния'),(704,'Tampa',189,27.99,-82.45,'Тампа'),(705,'Arlington',189,32.70," +
                    "-97.13,'Арлингтон'),(706,'Tulsa',189,36.13,-95.90,'Талса'),(707,'Bakersfield',189,35.35,-119.04," +
                    "'Бейкерсфилд'),(708,'New Orleans',189,30.07,-89.93,'Новый Орлеан'),(709,'Wichita',189,37.69,-97" +
                    ".34,'Уичито'),(710,'Aurora',189,39.71,-104.73,'Аврора'),(711,'Cleveland',189,41.48,-81.68," +
                    "'Кливленд'),(712,'Anaheim',189,33.84,-117.86,'Анахайм'),(713,'Riverside',189,33.94,-117.39," +
                    "'Риверсайд'),(714,'San Juan',189,-31.54,-68.54,'Сан-Хуан'),(715,'Santa Ana',189,33.74,-117.88," +
                    "'Санта-Ана'),(716,'Henderson',189,36.01,-115.04,'Хендерсон'),(717,'Lexington',189,38.04,-84.46," +
                    "'Лексингтон'),(718,'Corpus Christi',189,27.73,-97.38,'Корпус-Кристи'),(719,'Stockton',189,37.98," +
                    "-121.31,'Стоктон'),(720,'St. Paul',189,44.95,-93.10,'Сент-Пол'),(721,'Cincinnati',189,39.14,-84" +
                    ".51,'Цинциннати'),(722,'Irvine',189,33.68,-117.77,'Ирвин'),(723,'Greensboro',189,36.10,-79.83," +
                    "'Гринсборо'),(724,'Pittsburgh',189,40.44,-79.98,'Питтсбург'),(725,'Lincoln',189,40.81,-96.68," +
                    "'Линкольн'),(726,'St. Louis',189,38.64,-90.25,'Сент-Луис'),(727,'Plano',189,33.05,-96.75," +
                    "'Плано'),(728,'Anchorage',189,61.15,-149.11,'Анкоридж'),(729,'Newark',189,40.72,-74.17,'Ньюарк')" +
                    ",(731,'Chula Vista',189,32.63,-117.01,'Чула Виста'),(732,'St. Petersburg',189,27.79,-82.67," +
                    "'Санкт-Петербург Флорида'),(733,'Jersey City',189,40.72,-74.07,'Джерси-Сити'),(734,'Fort Wayne'," +
                    "189,41.09,-85.14,'Форт Уэйн'),(735,'Toledo',189,41.66,-83.58,'Толедо'),(736,'Chandler',189,33" +
                    ".28,-111.85,'Чендлер'),(737,'Laredo',189,27.56,-99.49,'Ларедо'),(738,'Madison',189,43.08,-89.39," +
                    "'Мэдисон'),(739,'Scottsdale',189,33.69,-111.87,'Скоттсдейл'),(740,'Lubbock',189,33.57,-101.89," +
                    "'Лаббок'),(741,'Reno',189,39.55,-119.85,'Рино'),(742,'Gilbert',189,33.31,-111.75,'Гилберт')," +
                    "(743,'Buffalo',189,42.90,-78.85,'Буффало'),(744,'Glendale',189,33.58,-112.23,'Глендейл'),(745," +
                    "'North Las Vegas',189,36.29,-115.09,'Норт-Лас-Вегас'),(746,'Winston-Salem',189,36.10,-80.26," +
                    "'Уинстон-Салем'),(747,'Chesapeake',189,36.68,-76.30,'Чесапик'),(748,'Garland',189,32.91,-96.63," +
                    "'Гарленд'),(749,'Irving',189,32.86,-96.97,'Ирвинг'),(750,'Hialeah',189,25.87,-80.30,'Хайалиа')," +
                    "(751,'Norfolk',189,36.89,-76.26,'Норфолк'),(752,'Fremont',189,37.53,-121.99,'Фремонт'),(753," +
                    "'Boise',189,43.60,-116.23,'Бойсе'),(754,'Paradise',189,36.08,-115.14,'Парадайс'),(755," +
                    "'Richmond',189,37.53,-77.48,'Ричмонд'),(757,'Spokane',189,47.67,-117.43,'Спокан'),(758,'Tacoma'," +
                    "189,47.24,-122.45,'Такома'),(759,'Modesto',189,37.64,-121.00,'Модесто'),(760,'Fontana',189,34" +
                    ".10,-117.46,'Фонтана'),(761,'Des Moines',189,41.57,-93.61,'Де-Мойн'),(762,'San Bernardino',189," +
                    "34.14,-117.29,'Сан-Бернардино'),(763,'Baton Rouge',189,30.44,-91.13,'Батон-Руж'),(764,'Frisco'," +
                    "189,33.16,-96.82,'Фриско'),(765,'Salt Lake City',189,40.78,-111.93,'Солт-Лейк-Сити'),(766," +
                    "'Moreno Valley',189,33.92,-117.20,'Морено Вэлли'),(767,'Oxnard',189,34.20,-119.18,'Окснард')," +
                    "(768,'Santa Clarita',189,34.42,-118.50,'Санта-Кларита'),(770,'McKinney',189,33.20,-96.67," +
                    "'Маккинни'),(771,'Port St. Lucie',189,27.28,-80.39,'Порт-Сент-Люси'),(772,'Fayetteville',189,36" +
                    ".07,-94.17,'Фейетвилл'),(773,'Grand Rapids',189,42.96,-85.66,'Гранд-Рапидс'),(775,'Rochester'," +
                    "189,43.17,-77.62,'Рочестер'),(776,'Charleston',189,32.82,-79.96,'Чарльстон'),(777,'Palm " +
                    "Springs',189,26.63,-80.10,'Палм-Спрингс'),(778,'Sedona',189,34.86,-111.80,'Седона'),(779," +
                    "'Branson',189,36.65,-93.26,'Брэнсон'),(780,'Montreal',33,45.51,-73.56,'Монреаль'),(781," +
                    "'Calgary',33,51.05,-114.07,'Калгари'),(782,'Edmonton',33,53.53,-113.49,'Эдмонтон'),(783," +
                    "'Ottawa',33,45.42,-75.70,'Оттава'),(784,'Winnipeg',33,49.88,-97.15,'Виннипег'),(785,'Quebec " +
                    "City',33,46.81,-71.21,'Квебек'),(786,'Hamilton',33,43.26,-79.87,'Гамильтон'),(787,'Kitchener'," +
                    "33,43.42,-80.47,'Китченер'),(789,'Victoria',33,48.43,-123.36,'Виктория'),(790,'Halifax',33,44" +
                    ".65,-63.59,'Галифакс'),(791,'Oshawa',33,43.90,-78.85,'Ошава'),(792,'Windsor',33,42.28,-83.00," +
                    "'Виндзор'),(793,'Saskatoon',33,52.13,-106.68,'Саскатун'),(794,'St. Catharines',33,43.18,-79.23," +
                    "'Сент-Катаринс'),(795,'Regina',33,50.45,-104.61,'Регина'),(796,'St. Johns',33,47.48,-52.80," +
                    "'Сент-Джонс'),(797,'Kelowna',33,49.89,-119.50,'Келоуна'),(800,'Rishikesh',78,30.09,78.27," +
                    "'Ришикеш'),(801,'Gokarna',78,14.55,74.32,'Гокарна'),(802,'Arambol',78,15.70,73.70,'Арамболь')," +
                    "(803,'Tiruvannamalai',78,12.23,79.08,'Тируваннамалай'),(804,'Darjeeling',78,27.04,88.26," +
                    "'Дарджилинг'),(805,'Haridwar',78,29.94,78.15,'Харидвар'),(806,'Kanyakumari',78,8.08,77.55," +
                    "'Каньякумари'),(807,'Buddh Gaya',78,24.69,84.98,'Будд Гая'),(808,'Sarnath',78,25.37,83.03," +
                    "'Сарнатх'),(809,'Kushinagar',78,26.74,83.92,'Кушинагар'),(810,'Shrawasti',78,27.68,81.89," +
                    "'Шравасти'),(811,'Rajgir',78,25.03,85.42,'Раджгир'),(812,'Sankasya',78,30.37,76.36,'Санкасья')," +
                    "(813,'Tirumala',78,13.68,79.35,'Тирумала'),(814,'Badrinath',78,30.74,79.49,'Бадринатх'),(815," +
                    "'Kedarnath',78,30.73,79.07,'Кедарнатх'),(816,'Prayagraj',78,25.44,81.85,'Праяградж'),(817," +
                    "'Haridwar',78,29.95,78.16,'Харидвар'),(818,'Mathura',78,27.49,77.67,'Матхура'),(819,'Vrindavan'," +
                    "78,27.57,77.66,'Вриндаван'),(820,'Somnath',78,20.89,70.40,'Сомнатх'),(821,'Dwarka',78,22.24,68" +
                    ".97,'Дварка'),(822,'Jammu',78,32.73,74.86,'Джамму'),(823,'Ujjain',78,23.18,75.79,'Удджайн')," +
                    "(824,'Shirdi',78,19.76,74.48,'Ширди'),(825,'Palolem',78,15.01,74.02,'Палолем'),(826,'Varkala'," +
                    "78,8.74,76.72,'Варкала'),(827,'Alwar',78,27.55,76.63,'Алвар'),(828,'Amritapuri',78,9.09,76.49," +
                    "'Амритапури');";
            PreparedStatement statement = connection.prepareStatement(query);
            statement.execute();
            stringMaker("Table 'locations' added");
        } catch (SQLException e) {
            stringMaker("Problem with default insertion of locations");
        }
    }

    public static void insertDefaultLocationsNew(Connection connection) {
        try {
            TablesInitializer.locationTableMakerAlt(connection);
            String query = "INSERT INTO locations_old\n" +
                    "VALUES (8,'Tehran',80,35.70,51.42,'Тегеран'),(9,'Tashkent',191,41.30,69.27,'Ташкент'),(10," +
                    "'Sanaa',195,15.35,44.20,'Санаа'),(11,'Phnom Penh',31,11.57,104.92,'Пномпень'),(12,'Naypyidaw'," +
                    "120,19.75,96.13,'Нейпьидо'),(13,'Muscat',132,23.61,58.59,'Маскат'),(14,'Manila',140,14.60,120" +
                    ".98,'Манила'),(15,'Male',106,4.18,73.51,'Мале'),(16,'Lhasa',37,29.65,91.10,'Лхаса'),(17,'Kuwait " +
                    "City',92,29.38,47.98,'Кувейт'),(18,'Kathmandu',123,27.72,85.37,'Катманду'),(19,'Kabul',1,34.53," +
                    "69.17,'Кабул'),(20,'Islamabad',133,33.70,73.04,'Исламабад'),(21,'Dushanbe',174,38.57,68.79," +
                    "'Душанбе'),(22,'Doha',143,25.30,51.53,'Доха'),(23,'Dhaka',14,23.72,90.40,'Дакка'),(24,'Colombo'," +
                    "167,6.92,79.83,'Коломбо'),(25,'Bishkek',93,42.87,74.57,'Бишкек'),(26,'Beirut',96,33.89,35.51," +
                    "'Бейрут'),(27,'Bandar Seri Begawan',25,4.92,114.92,'Бандар-Сери-Бегаван'),(28,'Baghdad',81,33" +
                    ".35,44.42,'Багдад'),(29,'Astana',88,51.13,71.43,'Астана'),(30,'Ashgabat',183,37.95,58.38," +
                    "'Ашхабад'),(31,'Amman',87,31.95,35.93,'Амман'),(32,'Manama',13,26.22,50.58,'Манама'),(33," +
                    "'Tbilisi',64,41.72,44.79,'Тбилиси'),(34,'Baku',11,40.37,49.84,'Баку'),(35,'Yerevan',8,40.18,44" +
                    ".51,'Ереван'),(36,'Honolulu',189,21.33,-157.85,'Гонолулу'),(37,'San Francisco',189,37.76,-122" +
                    ".44,'Сан-Франциско'),(38,'Orlando',189,28.48,-81.34,'Орландо'),(39,'Las Vegas',189,36.23,-115" +
                    ".27,'Лас Вегас'),(40,'Los Angeles',189,34.11,-118.41,'Лос-Анджелес'),(41,'Miami',189,25.78,-80" +
                    ".21,'Майами'),(42,'New York',189,40.69,-73.92,'Нью-Йорк'),(43,'Johannesburg',163,-26.20,28.04," +
                    "'Йоханнесбург'),(44,'Dammam',153,26.43,50.10,'Даммам'),(45,'Riyadh',153,24.65,46.71,'Эр-Рияд')," +
                    "(47,'Cancun',112,21.16,-86.85,'Канкун'),(48,'Fukuoka',86,33.59,130.40,'Фукуока'),(49,'Chiba',86," +
                    "35.60,140.10,'Чиба'),(50,'Kyoto',86,35.01,135.77,'Киото'),(51,'Osaka',86,34.69,135.50,'Осака')," +
                    "(52,'Jerusalem',83,31.78,35.22,'Иерусалим'),(53,'Batam',79,1.11,104.04,'Батам'),(55,'Kolkatta'," +
                    "78,22.54,88.34,'Калькутта'),(56,'Jaipur',78,26.92,75.87,'Джайпур'),(57,'Chennai',78,13.08,80.28," +
                    "'Ченнаи'),(58,'Hurgada',52,27.22,33.83,'Хургада'),(59,'Beijing',37,39.91,116.39,'Пекин'),(60," +
                    "'Zhuhai',37,22.28,113.57,'Чжухай'),(61,'Guilin',37,25.27,110.28,'Гуйлинь'),(62,'Vancouver',33,49" +
                    ".25,-123.10,'Ванкувер'),(63,'Toronto',33,43.74,-79.37,'Торонто'),(64,'Rio de Janeiro',24,-22.91," +
                    "-43.20,'Рио де Жанейро'),(65,'Buenos Aires',7,-34.60,-58.38,'Буэнос айрес'),(66,'Bangalore',78," +
                    "12.97,77.60,'Бангалор'),(67,'Krabi',176,8.06,98.92,'Краби'),(68,'Jeju',164,33.51,126.52,'Чеджу')" +
                    ",(69,'Abu Dhabi',187,24.48,54.37,'Абу Даби'),(70,'Auckland',125,-36.85,174.78,'Окленд'),(71," +
                    "'Cebu',140,10.30,123.90,'Себу'),(72,'Sydney',9,-33.87,151.21,'Сидней'),(73,'Melbourne',9,-37.81," +
                    "144.96,'Мельбурн'),(74,'Marrakech',118,31.63,-7.98,'Марракеш'),(75,'Penang Island',105,5.38,100" +
                    ".25,'Остров Пенанг'),(76,'Jakarta',79,-6.21,106.85,'Джакарта'),(77,'Ha Noi',194,21.03,105.85," +
                    "'Ханой'),(78,'Cairo',52,30.06,31.24,'Каир'),(79,'Johor Bahru',105,1.46,103.76,'Джохор-Бару')," +
                    "(80,'Denpasar',79,-8.67,115.22,'Денпасар'),(81,'Ho Chi Minh',194,10.78,106.70,'Хо Ши Мин'),(82," +
                    "'Shanghai',37,31.17,121.47,'Шанхай'),(83,'Seoul',164,37.58,127.00,'Сеул'),(84,'Medina',153,24" +
                    ".47,39.60,'Медина'),(85,'Guangzhou',37,23.13,113.26,'Гуанчжоу'),(86,'Mecca',153,21.42,39.83," +
                    "'Мекка'),(87,'Taipei',173,25.05,121.53,'Тайбэй'),(88,'Pattaya',176,12.93,100.90,'Паттайя'),(89," +
                    "'Tokyo',86,35.69,139.69,'Токио'),(90,'Phuket',176,7.89,98.40,'Пхукет'),(91,'Mumbai',78,18.97,72" +
                    ".83,'Мумбаи'),(92,'Shenzhen',37,22.54,114.05,'Шэньчжэнь'),(93,'Delhi',78,28.66,77.23,'Дели')," +
                    "(94,'Kuala Lumpur',105,3.15,101.70,'Куала Лумпур'),(95,'Dubai',187,25.27,55.31,'Дубай'),(96," +
                    "'Singapore',158,1.30,103.80,'Сингапур'),(97,'Macau',37,22.20,113.55,'Макао'),(98,'Bangkok',176," +
                    "13.75,100.52,'Бангкок'),(99,'Hong Kong',37,22.31,114.19,'Гонконг'),(100,'Antwerp',17,51.22,4.40," +
                    "'Антверпен'),(101,'Aberdeen',188,57.15,-2.11,'Абердин'),(102,'Augsburg',65,48.37,10.90," +
                    "'Аугсбург'),(103,'Alexandroupolis',67,40.85,25.87,'Александруполис'),(104,'Athens',67,37.98,23" +
                    ".72,'Афины'),(105,'Alicante',166,38.35,-0.48,'Аликанте'),(106,'Almeria',166,36.84,-2.46," +
                    "'Альмерия'),(107,'Aalborg',47,57.03,9.92,'Ольборг'),(108,'Aarhus',47,56.16,10.21,'Орхус'),(109," +
                    "'Ancona',84,43.62,13.52,'Анкона'),(110,'Aosta',84,45.74,7.32,'Аоста'),(111,'Amsterdam',124,52" +
                    ".35,4.92,'Амстердам'),(112,'Alanya',182,36.54,32.00,'Аланья'),(113,'Ankara',182,39.93,32.85," +
                    "'Анкара'),(114,'Antalya',182,36.91,30.70,'Анталия'),(115,'Altenrhein',171,47.49,9.55," +
                    "'Альтенрайн'),(116,'Brussels',17,50.85,4.35,'Брюссель'),(117,'Burgas',26,42.50,27.47,'Бургас')," +
                    "(118,'Banja Luka',22,44.77,17.18,'Баня-Лука'),(119,'Belfast',188,54.60,-5.93,'Белфаст'),(120," +
                    "'Birmingham',188,52.48,-1.90,'Бирмингем'),(121,'Bournemouth',188,50.72,-1.88,'Борнмут'),(122," +
                    "'Bristol',188,51.45,-2.58,'Бристоль'),(123,'Budapest',76,47.50,19.04,'Будапешт'),(124,'Berlin'," +
                    "65,52.52,13.38,'Берлин'),(126,'Bremen',65,53.12,8.80,'Бремен'),(127,'Billund',47,55.73,9.12," +
                    "'Биллунд'),(128,'Barcelona',166,41.38,2.18,'Барселона'),(129,'Bilbao',166,43.26,-2.95,'Бильбао')" +
                    ",(130,'Bologna',84,44.49,11.34,'Болонья'),(131,'Bergen',131,60.39,5.32,'Берген'),(132,'Bodo'," +
                    "131,67.28,14.38,'Бодо'),(134,'Bucharest',144,44.40,26.08,'Бухарест'),(135,'Belgrade',155,44.82," +
                    "20.47,'Белград'),(136,'Bratislava',159,48.14,17.11,'Братислава'),(137,'Bordeaux',61,44.84,-0.58," +
                    "'Бордо'),(139,'Brno',45,49.20,16.61,'Брно'),(140,'Basel',171,47.56,7.59,'Базель'),(141,'Bern'," +
                    "171,46.95,7.45,'Берн'),(142,'Cardiff',188,51.48,-3.18,'Кардифф'),(143,'Cambridge',188,43.40,-80" +
                    ".31,'Кембридж'),(144,'Coventry',188,52.41,-1.51,'Ковентри'),(145,'Cologne',65,50.94,6.96," +
                    "'Кёльн'),(146,'Corfu',67,39.59,19.86,'Корфу'),(147,'Copenhagen',47,55.68,12.56,'Копенгаген')," +
                    "(150,'Cork',82,51.90,-8.47,'Корк'),(151,'Cagliari',84,39.22,9.10,'Кальяри'),(152,'Catania',84,37" +
                    ".50,15.09,'Катания'),(153,'Cluj-Napoca',144,46.78,23.56,'Клуж-Напока'),(154,'Clermont-Ferrand'," +
                    "61,45.78,3.08,'Клермон-Ферран'),(155,'Chambery-Savoie',61,45.57,5.91,'Шамбери-Савойя'),(156," +
                    "'Cherbourg',61,49.65,-1.65,'Шербур'),(158,'Doncaster',188,53.52,-1.13,'Донкастер'),(159," +
                    "'Dortmund',65,51.51,7.47,'Дортмунд'),(160,'Dresden',65,51.05,13.74,'Дрезден'),(161," +
                    "'Duesseldorf',65,51.23,6.78,'Дюссельдорф'),(162,'Dublin',82,53.34,-6.27,'Дублин'),(163," +
                    "'Dalaman',182,36.81,28.88,'Даламан'),(164,'Dubrovnik',42,42.64,18.11,'Дубровник'),(165,'East " +
                    "Midlands',188,52.80,-0.67,'Ист-Мидлендс'),(166,'Edinburgh',188,55.95,-3.19,'Эдинбург'),(167," +
                    "'Exeter',188,50.72,-3.53,'Эксетер'),(169,'Esbjerg',47,55.47,8.45,'Эсбьерг'),(171,'Eilat',83,29" +
                    ".56,34.95,'Эйлат'),(172,'Eindhoven',124,51.43,5.50,'Эйндховен'),(174,'Frankfurt',65,50.11,8.68," +
                    "'Франкфурт'),(175,'Friedrichshafen',65,47.65,9.48,'Фридрихсхафен'),(176,'Fuerteventura',166,28" +
                    ".40,-14.00,'Фуэртевентура'),(177,'Florence',84,43.77,11.25,'Флоренция'),(178,'Floro',131,61.60,5" +
                    ".02,'Флоро'),(179,'Faro',142,37.02,-7.93,'Фаро'),(180,'Funchal',142,32.65,-16.92,'Фуншал'),(181," +
                    "'Graz',10,47.07,15.43,'Грац'),(182,'Gorna Oryahovitsa',26,43.12,25.69,'Горна Оряховица'),(183," +
                    "'Guernsey',188,57.17,-7.37,'Гернси'),(184,'Glasgow',188,55.86,-4.25,'Глазго'),(185," +
                    "'Gloucestershire',188,51.76,-2.19,'Глостершир'),(186,'Granada',166,37.18,-3.60,'Гранада'),(187," +
                    "'Girona',166,41.98,2.82,'Жирона'),(188,'Galway',82,53.27,-9.04,'Голуэй'),(189,'Genoa',84,44.41,8" +
                    ".93,'Генуя'),(190,'Groningen',124,53.22,6.58,'Гронинген'),(191,'Gdansk',141,54.37,18.63," +
                    "'Гданьск'),(192,'Geneva',171,46.20,6.15,'Женева'),(193,'Gothenburg',170,57.67,11.98,'Гетеборг')," +
                    "(194,'Humberside',188,53.57,-0.35,'Хамберсайд'),(196,'Hamburg',65,53.55,10.00,'Гамбург'),(197," +
                    "'Hannover',65,52.37,9.74,'Ганновер'),(200,'Heraklion',67,35.34,25.13,'Ираклион'),(201," +
                    "'Helsinki',60,60.18,24.93,'Хельсинки'),(202,'Innsbruck',10,47.27,11.39,'Инсбрук'),(203," +
                    "'Inverness',188,57.48,-4.22,'Инвернесс'),(204,'Debrecen',76,47.53,21.64,'Дебрецен'),(205," +
                    "'Ibiza',166,38.91,1.43,'Ибица'),(206,'Izmir',182,38.41,27.14,'Измир'),(207,'Istanbul',182,41.01," +
                    "28.96,'Стамбул'),(208,'Jonkoping',170,57.78,14.17,'Йёнчёпинг'),(209,'Klagenfurt',10,46.62,14.30," +
                    "'Клагенфурт'),(210,'Karlsruhe',65,49.02,8.40,'Карлсруэ'),(211,'Kortrijk',17,50.83,3.27," +
                    "'Кортрейк'),(212,'Kaunas',101,54.90,23.93,'Каунас'),(213,'Katowice',141,50.25,19.00,'Катовице')," +
                    "(214,'Krakow',141,50.06,19.94,'Краков'),(215,'Kosice',159,48.72,21.25,'Кошице'),(216,'Karlovy " +
                    "Vary',45,50.23,12.87,'Карловы Вары'),(217,'Karlstad',170,59.37,13.50,'Карлстад'),(218," +
                    "'Kuressaare',56,58.25,22.49,'Курессааре'),(219,'Linz',10,48.30,14.28,'Линц'),(220,'Liege',17,50" +
                    ".63,5.59,'Льеж'),(221,'Lands End',188,50.07,-5.71,'Лендс-Энд'),(222,'Liverpool',188,53.40,-2.98," +
                    "'Ливерпуль'),(223,'Lydd',188,50.95,0.91,'Лидд'),(224,'Leeds',188,53.80,-1.55,'Лидс'),(225," +
                    "'London',188,51.51,-0.13,'Лондон'),(226,'Luebeck',65,53.87,10.68,'Любек'),(227,'Lanzarote',166," +
                    "29.01,-13.63,'Лансароте'),(228,'Las Palmas de Gran Canaria',166,28.10,-15.41," +
                    "'Лас-Пальмас-де-Гран-Канария'),(230,'Lamezia Terme',84,38.96,16.30,'Ламеция Терме'),(231," +
                    "'Larnaca',44,34.92,33.63,'Ларнака'),(232,'Liepaja',95,56.51,21.01,'Лиепая'),(233,'Luxembourg'," +
                    "102,49.61,6.13,'Люксембург'),(235,'Lisbon',142,38.75,-9.16,'Лиссабон'),(236,'Ljubljana',160,46" +
                    ".05,14.52,'Любляна'),(237,'Lappeenranta',60,61.06,28.19,'Лаппеенранта'),(238,'Le Touquet',61,43" +
                    ".87,0.30,'Ле-Туке-Пари-Плаж'),(239,'Lille',61,50.63,3.06,'Лилль'),(240,'Lyon',61,45.76,4.84," +
                    "'Лион'),(241,'Lugano',171,46.01,8.96,'Лугано'),(242,'Lulea',170,65.58,22.15,'Лулео'),(243," +
                    "'Manchester',188,53.48,-2.25,'Манчестер'),(244,'Mannheim',65,49.49,8.47,'Мангейм'),(245," +
                    "'Memmingen',65,47.99,10.18,'Мемминген'),(246,'Muenster',65,51.96,7.63,'Мюнстер'),(247,'Munich'," +
                    "65,48.14,11.58,'Мюнхен'),(248,'Madrid',166,40.42,-3.69,'Мадрид'),(249,'Malaga',166,36.72,-4.42," +
                    "'Малага'),(250,'Mahon',82,51.89,-8.40,'Махон'),(251,'Murcia',166,37.99,-1.14,'Мурсия'),(252," +
                    "'Milan',84,45.47,9.19,'Милан'),(253,'Malta',108,42.99,-73.79,'Мальта'),(254,'Monte Carlo',115,43" +
                    ".74,7.43,'Монте-Карло'),(255,'Maastricht',124,50.85,5.68,'Маастрихт'),(257,'Milas',182,37.27,27" +
                    ".81,'Милас'),(259,'Marseille',61,43.30,5.37,'Марсель'),(260,'Metz',61,49.12,6.18,'Мец'),(261," +
                    "'Montpellier',61,43.61,3.88,'Монпелье'),(262,'Malmo',170,55.61,13.00,'Мальме'),(263,'Norwich'," +
                    "188,52.63,1.30,'Норвич'),(264,'Newcastle',188,55.01,-1.66,'Ньюкасл'),(265,'Newquay',188,50.41,-5" +
                    ".08,'Ньюквей'),(266,'Nuremberg',65,49.45,11.08,'Нюрнберг'),(267,'Naples',84,40.83,14.25," +
                    "'Неаполь'),(268,'Constanta',144,44.17,28.64,'Констанца'),(269,'Nantes',61,47.22,-1.55,'Нант')," +
                    "(270,'Nice',61,43.70,7.27,'Ницца'),(271,'Norrkoping',170,58.59,16.19,'Норрчёпинг'),(272," +
                    "'Ostend',17,51.23,2.92,'Остенде'),(273,'Alderney',188,49.73,-2.23,'Олдерни'),(274,'Oviedo',166," +
                    "43.36,-5.84,'Овьедо'),(275,'Olbia',84,40.91,9.52,'Ольвия'),(276,'Ohrid',130,41.12,20.80,'Охрид')" +
                    ",(277,'Oslo',131,59.91,10.75,'Осло'),(279,'Ostrava',45,49.84,18.29,'Острава'),(280,'Plovdiv',26," +
                    "42.14,24.75,'Пловдив'),(281,'Plymouth',188,50.37,-4.14,'Плимут'),(282,'Paderborn',65,51.72,8.77," +
                    "'Падерборн'),(283,'Rostock',65,54.08,12.13,'Росток'),(284,'Palma Majorca',166,39.57,2.65,'Пальма" +
                    " Майорка'),(285,'Palermo',84,38.12,13.36,'Палермо'),(286,'Pescara',84,42.46,14.21,'Пескара')," +
                    "(287,'Pisa',84,43.72,10.40,'Пиза'),(288,'Paphos',44,34.78,32.43,'Пафос'),(289,'Palanga',101,55" +
                    ".92,21.06,'Паланга'),(290,'Ponta Delgada',142,37.74,-25.67,'Понта-Делгада'),(291,'Porto',142,41" +
                    ".15,-8.61,'Порту'),(292,'Poprad',159,49.05,20.30,'Попрад'),(293,'Paris',61,48.86,2.35,'Париж')," +
                    "(294,'Pula',42,44.87,13.83,'Пула'),(295,'Podgorica',117,42.44,19.27,'Подгорица'),(296," +
                    "'Pardubice',45,50.04,15.78,'Пардубице'),(297,'Prague',45,50.08,14.42,'Прага'),(298,'Parnu',56,58" +
                    ".38,24.50,'Пярну'),(299,'Rhodes',67,36.44,28.22,'Родос'),(300,'Reykjavik',77,64.15,-21.94," +
                    "'Рейкьявик'),(301,'Reus',166,41.16,1.11,'Реус'),(302,'Rijeka',42,45.33,14.43,'Риека'),(303," +
                    "'Rome',84,41.89,12.48,'Рим'),(304,'Rimini',84,44.06,12.57,'Римини'),(305,'Riga',95,56.95,24.11," +
                    "'Рига'),(306,'Rotterdam',124,51.92,4.48,'Роттердам'),(307,'Ronneby',170,56.30,15.28,'Роннеби')," +
                    "(308,'Salzburg',10,47.80,13.05,'Зальцбург'),(309,'Sofia',26,42.70,23.32,'София'),(310," +
                    "'Sarajevo',22,43.87,18.42,'Сараево'),(311,'Southampton',188,50.90,-1.40,'Саутгемптон'),(312," +
                    "'Swansea',188,41.76,-71.21,'Суонси'),(313,'Shoreham',188,50.83,-0.27,'Шорхэм '),(314,'Poznan'," +
                    "141,52.40,16.92,'Познань'),(315,'Saarbruecken',65,49.23,7.00,'Саарбрюккен'),(316,'Stuttgart',65," +
                    "48.78,9.18,'Штутгарт'),(317,'Santorini',67,36.41,25.46,'Санторини'),(318,'Shannon',82,52.71,-8" +
                    ".87,'Шеннон'),(319,'Salamanca',166,20.57,-101.20,'Саламанка'),(320,'Santiago de Compostela',166," +
                    "42.88,-8.55,'Сантьяго-де-Компостела'),(321,'Sevilla',166,37.38,-5.97,'Севилья'),(322,'Siauliai'," +
                    "101,55.93,23.32,'Шяуляй'),(323,'Skopje',130,41.98,21.43,'Скопье'),(325,'Stavanger',131,58.97,5" +
                    ".73,'Ставангер'),(326,'Strasbourg',61,48.58,7.75,'Страсбург'),(327,'Split',42,43.51,16.45," +
                    "'Расколоть'),(328,'Sion',171,46.23,7.37,'Сион'),(329,'Stockholm',170,59.33,18.07,'Стокгольм')," +
                    "(330,'Tirana',2,41.33,19.82,'Тирана'),(331,'Thessaloniki',67,40.63,22.95,'Салоники'),(332," +
                    "'Tenerife',166,28.22,-16.59,'Тенерифе'),(333,'Treviso',84,45.67,12.24,'Тревизо'),(334,'Trieste'," +
                    "84,45.64,13.80,'Триест'),(335,'Turin',84,45.07,7.70,'Турин'),(336,'Tel-Aviv',83,32.08,34.80," +
                    "'Тель-Авив'),(337,'Terceira Island',142,38.72,-27.22,'Остров Терсейра'),(338,'Timisoara',144,45" +
                    ".76,21.23,'Тимишоара'),(339,'Trabzon',182,41.01,39.72,'Трабзон'),(340,'Tampere',60,61.50,23.76," +
                    "'Тампере'),(341,'Turku',60,60.45,22.27,'Турку'),(342,'Toulouse',61,43.60,1.44,'Тулуза'),(343," +
                    "'Tivat',117,42.43,18.70,'Тиват'),(344,'Trollhattan',170,58.28,12.29,'Тролльхеттан'),(345," +
                    "'Tallinn',56,59.44,24.75,'Таллинн'),(346,'Tartu',56,58.38,26.72,'Тарту'),(347,'Umea',170,63.83," +
                    "20.26,'Умео'),(348,'Vienna',10,48.21,16.37,'Вена'),(349,'Varna',26,43.21,27.92,'Варна'),(351," +
                    "'Valencia',166,10.17,-68.00,'Валенсия'),(352,'Valladolid',166,41.65,-4.73,'Вальядолид'),(353," +
                    "'Venice',84,45.44,12.33,'Венеция'),(354,'Verona',84,45.44,10.99,'Верона'),(355,'Ventspils',95,57" +
                    ".39,21.56,'Вентспилс'),(356,'Vilnius',101,54.68,25.28,'Вильнюс'),(357,'Iasi',144,47.16,27.59," +
                    "'Яссы'),(358,'Vaxjo',170,56.88,14.81,'Ваксьо'),(359,'Visby',170,57.63,18.31,'Висбй'),(361," +
                    "'Weeze',65,51.63,6.20,'Веце'),(362,'Westerland',65,54.91,8.31,'Вестерланд'),(363," +
                    "'Wilhelmshaven',65,53.52,8.13,'Вильгельмсхафен'),(364,'Warsaw',141,52.22,21.03,'Варшава'),(365," +
                    "'Wroclaw',141,51.11,17.04,'Вроцлав'),(366,'Zweibruecken',65,49.25,7.36,'Цвайбрюккен '),(367," +
                    "'Zaragoza',166,41.65,-0.88,'Сарагоса'),(368,'Zagreb',42,45.80,15.95,'Загреб'),(369,'Zadar',42,44" +
                    ".12,15.22,'Задар'),(370,'Zurich',171,47.37,8.54,'Цюрих'),(371,'Chisinau',114,47.01,28.86," +
                    "'Кишинёв'),(372,'Minsk',16,53.90,27.56,'Минск'),(373,'Gomel',16,52.44,30.98,'Гомель'),(374," +
                    "'Brest',16,52.08,23.66,'Брест'),(375,'Vitebsk',16,55.18,30.17,'Витебск'),(376,'Hrodna',16,53.67," +
                    "23.82,'Гродно'),(377,'Kiev',186,50.45,30.52,'Киев'),(378,'Kherson',186,46.63,32.60,'Херсон')," +
                    "(379,'Chernivtsi',186,48.29,25.93,'Черновцы'),(380,'Odesa',186,46.48,30.73,'Одесса'),(381," +
                    "'Zaporizhia',186,47.85,35.12,'Запорожье'),(382,'Vinnytsia',186,49.24,28.47,'Винница'),(383," +
                    "'Lviv',186,49.84,24.03,'Львов'),(384,'Dnipro',186,48.45,34.98,'Днепр'),(385,'Kharkiv',186,50.00," +
                    "36.23,'Харьков'),(386,'Ivano-Frankivsk',186,48.92,24.71,'Ивано-Франковск'),(387,'Moscow',145,55" +
                    ".76,37.62,'Москва'),(388,'Saint Petersburg',145,59.95,30.32,'Санкт-Петербург'),(389,'Sochi',145," +
                    "43.59,39.72,'Сочи'),(390,'Novosibirsk',145,55.03,82.92,'Новосибирск'),(391,'Ekaterinburg',145,56" +
                    ".84,60.61,'Екатеринбург'),(392,'Krasnodar',145,45.03,38.98,'Краснодар'),(393,'Anapa',145,44.89," +
                    "37.32,'Анапа'),(394,'Kaliningrad',145,54.72,20.50,'Калининград'),(395,'Platov',145,49.09,41.68," +
                    "'Платов'),(396,'Samara',145,53.18,50.12,'Самара'),(397,'Irkutsk',145,52.28,104.30,'Иркутск')," +
                    "(398,'Krasnoyarsk',145,56.02,92.87,'Красноярск'),(399,'Ufa',145,54.73,55.97,'Уфа'),(400,'Kazan'," +
                    "145,55.79,49.11,'Казань'),(401,'Mineralnye Vody',145,44.20,43.11,'Минеральные Воды'),(402," +
                    "'Tyumen',145,57.15,65.53,'Тюмень'),(403,'Khabarovsk',145,48.48,135.07,'Хабаровск'),(404," +
                    "'Surgut',145,61.25,73.43,'Сургут'),(405,'Vladivostok',145,43.12,131.90,'Владивосток'),(406," +
                    "'Yakutsk',145,62.03,129.73,'Якутск'),(407,'Perm',145,58.01,56.25,'Пермь'),(408,'Chelyabinsk'," +
                    "145,55.15,61.40,'Челябинск'),(409,'Novy Urengoy',145,66.09,76.70,'Новый Уренгой'),(410," +
                    "'Murmansk',145,68.97,33.08,'Мурманск'),(411,'Nizhniy Novgorod',145,56.33,44.01,'Нижний " +
                    "Новгород'),(412,'Volgograd',145,48.70,44.48,'Волгоград'),(413,'Yuzhno-Sakhalinsk',145,46.95,142" +
                    ".73,'Южно-Сахалинск'),(414,'Arkhangelsk',145,64.55,40.53,'Архангельск'),(415,'Omsk',145,54.97,73" +
                    ".38,'Омск'),(416,'Makhachkala',145,42.98,47.48,'Махачкала'),(417,'Gelendzik',145,44.56,38.08," +
                    "'Геленджик'),(418,'Petropavlovsk-Kamchatsky',145,53.02,158.65,'Петропавловск-Камчатский'),(419," +
                    "'Naberezhnye Chelny',145,55.70,52.33,'Набережные Челны'),(420,'Tomsk',145,56.49,84.95,'Томск')," +
                    "(421,'Nizhnevartovsk',145,60.94,76.60,'Нижневартовск'),(422,'Orenburg',145,51.77,55.10," +
                    "'Оренбург'),(423,'Voronezh',145,51.67,39.21,'Воронеж'),(424,'Syktyvkar',145,61.67,50.82," +
                    "'Сыктывкар'),(425,'Barnaul',145,53.36,83.79,'Барнаул'),(426,'Astrakhan',145,46.33,48.02," +
                    "'Астрахань'),(427,'Norilsk',145,69.33,88.22,'Норильск'),(428,'Belgorod',145,50.60,36.60," +
                    "'Белгород'),(429,'Salehard',145,66.53,66.63,'Салехард'),(430,'Chita',145,52.03,113.50,'Чита')," +
                    "(431,'Izhevsk',145,56.85,53.22,'Ижевск'),(432,'Khanty-Mansiysk',145,61.00,69.00," +
                    "'Ханты-Мансийск'),(433,'Saratov',145,51.53,46.00,'Саратов'),(434,'Stavropol',145,45.05,41.98," +
                    "'Ставрополь'),(437,'Kemerovo',145,55.33,86.07,'Кемерово'),(438,'Abakan',145,53.72,91.42," +
                    "'Абакан'),(439,'Grozny',145,43.31,45.70,'Грозный'),(441,'Vladikavkaz',145,43.02,44.65," +
                    "'Владикавказ'),(442,'Ulyanovsk',145,54.32,48.37,'Ульяновск'),(444,'Penza',145,53.20,45.00," +
                    "'Пенза'),(445,'Saransk',145,54.18,45.18,'Саранск'),(446,'Nadym',145,65.53,72.52,'Надым'),(447," +
                    "'Magnitogorsk',145,53.38,59.03,'Магнитогорск'),(448,'Rostov on Don',145,47.23,39.72,'Ростов на " +
                    "Дону'),(449,'Cheboksary',145,56.13,47.25,'Чебоксары'),(451,'Nalchik',145,43.48,43.62,'Нальчик')," +
                    "(452,'Cherepovets',145,59.13,37.92,'Череповец'),(453,'Magas',145,43.17,44.82,'Магас'),(454," +
                    "'Kirov',145,58.60,49.65,'Киров'),(455,'Naryan-Mar',145,67.64,53.01,'Нарьян-Мар'),(456,'Bratsk'," +
                    "145,56.17,101.62,'Братск'),(457,'Elista',145,46.32,44.27,'Элиста'),(458,'Gorno-Altaysk',145,51" +
                    ".96,85.96,'Горно-Алтайск'),(460,'Tambov',145,52.72,41.43,'Тамбов'),(461,'Vorkuta',145,67.50,64" +
                    ".03,'Воркута'),(462,'Neryungri',145,56.66,124.73,'Нерюнгри'),(463,'Ivanovo',145,57.00,41.00," +
                    "'Иваново'),(464,'Anadyr',145,64.73,177.52,'Анадырь'),(465,'Kursk',145,51.74,36.19,'Курск'),(466," +
                    "'Kogalym',145,62.27,74.49,'Когалым'),(467,'Kurgan',145,55.44,65.34,'Курган'),(468," +
                    "'Petrozavodsk',145,61.78,34.35,'Петрозаводск'),(469,'Orsk',145,51.21,58.54,'Орск'),(471," +
                    "'Kaluga',145,54.53,36.27,'Калуга'),(472,'Okha',145,53.58,142.93,'Оха'),(473,'Briansk',145,53.24," +
                    "34.37,'Брянск'),(475,'Kyzyl',145,51.72,94.45,'Кызыл'),(476,'Tiksi',145,71.63,128.84,'Тикси')," +
                    "(477,'Yaroslavl',145,57.62,39.85,'Ярославль'),(478,'Pevek',145,69.70,170.32,'Певек'),(480," +
                    "'Velikij Ustyug',145,60.76,46.30,'Великий Устюг'),(481,'Aldan',145,58.60,125.38,'Алдан'),(483," +
                    "'Beloyarsky',145,63.72,66.67,'Белоярский'),(484,'Bodaybo',145,57.85,114.19,'Бодайбо'),(485," +
                    "'Ust-Kut',145,56.78,105.75,'Усть-Кут'),(486,'Usinsk',145,66.00,57.54,'Усинск'),(487,'Nyagan'," +
                    "145,62.13,65.38,'Нягань'),(489,'Lensk',145,60.72,114.90,'Ленск'),(490,'Batagay',145,67.66,134" +
                    ".64,'Батагай'),(491,'Uraj',145,60.13,64.78,'Урай'),(492,'Nikolaevsk-na-Amure',145,53.15,140.73," +
                    "'Николаевск-на-Амуре'),(493,'Berezovo',145,54.09,39.30,'Березово'),(494,'Bugulma',145,54.53,52" +
                    ".78,'Бугульма'),(498,'Belaya Gora',145,68.54,146.19,'Белая Гора'),(499,'Mendeleyevo',145,56.04," +
                    "37.23,'Менделеево'),(501,'Lipetsk',145,52.62,39.60,'Липецк'),(502,'Nyurba',145,63.28,118.33," +
                    "'Нюрба'),(504,'Ust-Maya',145,60.46,134.54,'Усть-Майя'),(505,'Iturup',145,44.99,147.84,'Итуруп')," +
                    "(507,'Keperveyem',145,67.84,166.14,'Кепервеем'),(508,'Deputatsky',145,69.34,139.95," +
                    "'Депутатский'),(510,'Ust-Nera',145,64.57,143.20,'Усть-Нера'),(512,'Terney',145,45.05,136.61," +
                    "'Терней'),(513,'Olenyok',145,68.53,112.45,'Оленек'),(514,'Cherskiy',145,68.75,161.33,'Черский')," +
                    "(515,'Kavalerovo',145,44.27,135.05,'Кавалерово'),(516,'Igarka',145,67.47,86.57,'Игарка'),(517," +
                    "'Igrim',145,63.19,64.42,'Игрим'),(519,'Ust-Kuyga',145,70.00,135.55,'Усть-Куйга'),(520,'Hatanga'," +
                    "145,72.04,102.47,'Хатанга'),(521,'Dalnegorsk',145,44.55,135.57,'Дальнегорск'),(522,'Nogliki'," +
                    "145,51.83,143.17,'Ноглики'),(523,'Chokurdah',145,70.62,147.89,'Чокурдах'),(526,'Tynda',145,55" +
                    ".15,124.72,'Тында'),(528,'Podkamennaya Tunguska',145,61.60,90.12,'Подкаменная Тунгуска'),(529," +
                    "'Zhigansk',145,66.77,123.37,'Жиганск'),(530,'Dikson',145,73.51,80.55,'Диксон'),(531," +
                    "'Verkhnevilyuysk',145,63.45,120.32,'Верхневилюйск'),(532,'Vilyuysk',145,63.75,121.62,'Вилюйск')," +
                    "(533,'Dalnerechensk',145,45.93,133.73,'Дальнереченск'),(534,'Svetlaya',145,65.22,41.01," +
                    "'Светлая'),(535,'Komsomolsk Na Amure',145,50.55,137.02,'Комсомольск на Амуре'),(538,'Plastun'," +
                    "145,44.76,136.29,'Пластун'),(539,'Kotlas',145,61.25,46.65,'Котлас'),(540,'Gagra',64,43.28,40.27," +
                    "'Гагра'),(541,'New Athos',64,43.09,40.81,'Новый Афон'),(542,'Sukhumi',64,43.00,41.00,'Сухуми')," +
                    "(543,'Ukhta',145,63.57,53.70,'Ухта'),(545,'Donetsk',186,48.00,37.78,'Донецк'),(546,'Pristina'," +
                    "91,42.67,21.17,'Приштина'),(547,'Thimphu',20,27.48,89.63,'Тхимпху'),(548,'Ulaanbaatar',116,47" +
                    ".92,106.92,'Улан-Батор'),(550,'Agartala',78,23.83,91.27,'Агартала'),(551,'Agra',78,27.18,78.02," +
                    "'Агра'),(552,'Ahmedabad',78,23.03,72.58,'Ахмадабад'),(553,'Aizawl',78,23.71,92.72,'Айзавл')," +
                    "(554,'Allahabad',78,25.46,81.84,'Аллахабад'),(555,'Amritsar',78,31.62,74.85,'Амритсар'),(556," +
                    "'Aurangabad',78,19.88,75.32,'Аурангабад'),(557,'Bagdogra',78,26.70,88.32,'Багдогра'),(558," +
                    "'Belgaum',78,15.87,74.50,'Белгаум'),(560,'Bhavnagar',78,21.77,72.14,'Бхавнагар'),(561,'Bhopal'," +
                    "78,23.25,77.42,'Бхопал'),(562,'Bhubaneswar',78,20.27,85.84,'Бхубанешвар'),(563,'Bhuj',78,23.25," +
                    "69.81,'Бхудж'),(564,'Bikaner',78,28.02,73.32,'Биканер'),(565,'Chandigarh',78,30.74,76.79," +
                    "'Чандигарх'),(566,'Coimbatore',78,11.00,76.97,'Коимбатур'),(567,'Dehradun',78,30.32,78.03," +
                    "'Дехрадун'),(568,'Dharamsala',78,32.22,76.32,'Дхарамсала'),(569,'Dibrugarh',78,27.48,95.00," +
                    "'Дибругарх'),(570,'Dimapur',78,25.91,93.73,'Димапур'),(571,'Diu',78,20.72,70.99,'Диу'),(572," +
                    "'Gaya',78,24.75,85.02,'Гая'),(573,'Chicalim',78,15.39,73.86,'Чикалим'),(574,'Gorakhpur',78,26" +
                    ".76,83.37,'Горакхпур'),(575,'Guwahati',78,26.17,91.77,'Гувахати'),(576,'Gwalior',78,26.22,78.19," +
                    "'Гвалиор'),(577,'Hubli',78,15.36,75.13,'Хубли-Дхарвад'),(578,'Hyderabad ',78,17.37,78.47," +
                    "'Хайдарабад'),(579,'Imphal',78,24.82,93.95,'Импхал'),(580,'Indore',78,22.72,75.85,'Индор'),(581," +
                    "'Jabalpur',78,23.17,79.93,'Джабалпур'),(582,'Jaisalmer',78,26.92,70.92,'Джайсалмер'),(583," +
                    "'Jalgaon',78,21.02,75.57,'Джалгаон'),(584,'Jammu',78,32.73,74.85,'Джамму'),(585,'Jamnagar',78,22" +
                    ".47,70.07,'Джамнагар'),(586,'Jodhpur',78,26.29,73.02,'Джодхпур'),(587,'Jorhat',78,26.75,94.22," +
                    "'Джорхат'),(588,'Kadapa',78,14.48,78.82,'Кадапа'),(589,'Kandla',78,32.69,76.07,'Кандла'),(590," +
                    "'Kanpur',78,26.46,80.32,'Канпур'),(591,'Kazi Nazrul Islam',78,23.62,87.24,'Кази Назрул Ислам')," +
                    "(592,'Khajuraho',78,24.85,79.93,'Кхаджурахо'),(593,'Kochi ',78,9.97,76.28,'Кочи'),(594," +
                    "'Kolhapur',78,16.70,74.23,'Колхапур'),(595,'Kozhikode',78,11.26,75.78,'Кожикоде'),(596,'Kulu'," +
                    "78,31.96,77.10,'Кулу'),(597,'Leh',78,34.16,77.58,'Лех'),(599,'Lucknow',78,26.85,80.95,'Лакхнау')" +
                    ",(600,'Ludhiana',78,30.91,75.85,'Лудхияна'),(601,'Madurai',78,9.92,78.12,'Мадурай'),(602," +
                    "'Mangalore',78,12.87,74.88,'Мангалор'),(603,'Mysore',78,12.31,76.65,'Майсур'),(604,'Nagpur',78," +
                    "21.15,79.08,'Нагпур'),(605,'Nanded',78,19.15,77.33,'Нандед'),(606,'Nasik',78,20.00,73.78," +
                    "'Насик'),(607,'Pantnagar',78,29.03,79.49,'Пантнагар'),(608,'Pasighat',78,28.06,95.33,'Пасигхат')" +
                    ",(609,'Patna',78,25.61,85.14,'Патна'),(610,'Porbandar',78,21.64,69.60,'Порбандар'),(611,'Port " +
                    "blair',78,11.67,92.75,'Порт-Блэр'),(612,'Puducherry',78,11.93,79.83,'Пудучерри'),(613,'Pune',78," +
                    "18.52,73.86,'Пуна'),(614,'Raipur',78,21.24,81.63,'Райпур'),(615,'Rajahmundry',78,16.98,81.78," +
                    "'Раджамандри'),(616,'Rajkot',78,22.30,70.80,'Раджкот'),(617,'Ranchi',78,23.36,85.33,'Ранчи')," +
                    "(618,'Salem ',78,11.65,78.17,'Салем'),(619,'Shillong',78,25.57,91.88,'Шиллонг'),(620,'Shimla'," +
                    "78,31.10,77.17,'Шимла'),(621,'Shirdi',78,24.79,92.79,'Ширди'),(622,'Silchar',78,24.79,92.79," +
                    "'Силчар'),(623,'Srinagar',78,34.09,74.81,'Сринагар'),(624,'Surat',78,21.17,72.83,'Сурат'),(625," +
                    "'Tezpur',78,26.63,92.80,'Тезпу'),(626,'Thiruvananthapuram',78,8.50,76.90,'Тируванантапурам')," +
                    "(627,'Tiruchirapalli',78,10.76,78.71,'Тиручирапалли'),(628,'Tirupati',78,13.65,79.42,'Тирупати')" +
                    ",(629,'Tuticorin',78,8.78,78.13,'Тутикорин'),(630,'Udaipur',78,24.58,73.68,'Удайпур'),(631," +
                    "'Vadodara',78,22.30,73.20,'Вадодара'),(632,'Varanasi',78,25.32,83.01,'Варанаси'),(633," +
                    "'Vidyanagar',78,15.36,75.13,'Видьянагар'),(634,'Vijayawada',78,16.51,80.62,'Виджаявада'),(635," +
                    "'Visakhapatnam',78,17.73,83.32,'Вишакхапатнам'),(636,'Chiang Mai',176,18.79,98.99,'Чиангмай')," +
                    "(637,'Hat Yai',176,7.00,100.46,'Хат Яй'),(638,'Koh Samui',176,9.50,100.00,'Самуй'),(639,'Udon " +
                    "Thani',176,17.42,102.75,'Удонтхани'),(640,'Chiang Rai',176,19.91,99.83,'Чианг Рай'),(641,'Khon " +
                    "Kaen',176,16.43,102.83,'Хон Каен'),(642,'Surat Thani',176,9.14,99.33,'Сурат Тани'),(643,'Ubon " +
                    "Ratchathani',176,15.23,104.86,'Убонратчатхани'),(644,'Nakhon Si Thammarat',176,8.43,99.97," +
                    "'Накхонситхаммарат'),(645,'Phitsanulok',176,16.82,100.26,'Пхитсанулок'),(646,'Trang',176,7.56,99" +
                    ".61,'Транг'),(647,'Roi Et',176,16.06,103.65,'Рои Эт'),(648,'Nakhon Phanom',176,17.40,104.79," +
                    "'Накхон Пханом'),(649,'Buri Ram',176,15.00,103.11,'Бури Рам'),(650,'Sakon Nakhon',176,17.16,104" +
                    ".15,'Сакон Накхон'),(651,'Lampang',176,18.30,99.50,'Лампанг'),(652,'Mae Sot ',176,16.71,98.57," +
                    "'Мэй Сот'),(653,'Ranong',176,9.96,98.64,'Ранонг'),(654,'Chumphon',176,10.49,99.18,'Чумпхон')," +
                    "(655,'Loei',176,17.49,101.73,'Лоэ'),(656,'Narathiwat',176,6.43,101.82,'Наратхиват'),(657,'Trat'," +
                    "176,12.24,102.51,'Трат'),(658,'Phrae',176,18.14,100.14,'Пхрэ'),(659,'Sukhothai',176,17.01,99.82," +
                    "'Сукотаи'),(660,'Mae Hong Son',176,19.30,97.97,'Мэй Хонг Сон'),(661,'Hua Hin ',176,12.57,99.95," +
                    "'Хуа Хин'),(662,'Pai ',176,19.36,98.44,'Пай'),(663,'Chicago',189,41.84,-87.69,'Чикаго'),(664," +
                    "'Houston',189,29.79,-95.39,'Хьюстон'),(665,'Phoenix',189,33.57,-112.09,'Феникс'),(666," +
                    "'Philadelphia',189,40.01,-75.13,'Филадельфия'),(667,'San Antonio',189,29.47,-98.53,'Сан " +
                    "Антонио'),(668,'San Diego',189,32.83,-117.12,'Сан Диего'),(669,'Dallas',189,32.79,-96.77," +
                    "'Даллас'),(670,'San Jose',189,37.30,-121.85,'Сан - Хосе'),(671,'Austin',189,30.30,-97.75," +
                    "'Остин'),(672,'Fort Worth',189,32.78,-97.35,'Форт-Уэрт'),(673,'Jacksonville',189,30.33,-81.67," +
                    "'Джексонвилл'),(674,'Columbus',189,39.99,-82.99,'Колумбус'),(675,'Charlotte',189,35.21,-80.83," +
                    "'Шарлотта'),(676,'Indianapolis',189,39.78,-86.15,'Индианаполис'),(677,'Seattle',189,47.62,-122" +
                    ".32,'Сиэтл'),(678,'Denver',189,39.76,-104.88,'Денвер'),(679,'Washington',189,38.90,-77.02," +
                    "'Вашингтон'),(680,'Boston',189,42.32,-71.08,'Бостон'),(681,'El Paso',189,31.85,-106.43," +
                    "'Эль-Пасо'),(682,'Nashville',189,36.17,-86.78,'Нашвилл'),(683,'Detroit',189,42.38,-83.10," +
                    "'Детройт'),(684,'Portland',189,45.54,-122.65,'Портленд'),(685,'Oklahoma City',189,35.47,-97.51," +
                    "'Оклахома-Сити'),(686,'Memphis',189,35.10,-89.98,'Мемфис'),(687,'Louisville',189,38.17,-85.65," +
                    "'Луисвилл'),(688,'Baltimore',189,39.31,-76.61,'Балтимор'),(689,'Milwaukee',189,43.06,-87.97," +
                    "'Милуоки'),(690,'Albuquerque',189,35.11,-106.65,'Альбукерке'),(691,'Tucson',189,32.15,-110.88," +
                    "'Тусон'),(692,'Fresno',189,36.78,-119.79,'Фресно'),(693,'Mesa',189,33.40,-111.72,'Меса'),(694," +
                    "'Atlanta',189,33.76,-84.42,'Атланта'),(695,'Sacramento',189,38.57,-121.47,'Сакраменто'),(696," +
                    "'Kansas City',189,39.12,-94.55,'Канзас-Сити'),(697,'Colorado Springs',189,38.87,-104.76," +
                    "'Колорадо-Спрингс'),(698,'Raleigh',189,35.83,-78.64,'Роли'),(699,'Omaha',189,41.26,-96.05," +
                    "'Омаха'),(700,'Long Beach',189,33.80,-118.17,'Лонг-Бич'),(701,'Virginia Beach',189,36.73,-76.04," +
                    "'Вирджиния Бич'),(702,'Minneapolis',189,44.96,-93.27,'Миннеаполис'),(703,'Oakland',189,37.79," +
                    "-122.22,'Окленд Калифорния'),(704,'Tampa',189,27.99,-82.45,'Тампа'),(705,'Arlington',189,32.70," +
                    "-97.13,'Арлингтон'),(706,'Tulsa',189,36.13,-95.90,'Талса'),(707,'Bakersfield',189,35.35,-119.04," +
                    "'Бейкерсфилд'),(708,'New Orleans',189,30.07,-89.93,'Новый Орлеан'),(709,'Wichita',189,37.69,-97" +
                    ".34,'Уичито'),(710,'Aurora',189,39.71,-104.73,'Аврора'),(711,'Cleveland',189,41.48,-81.68," +
                    "'Кливленд'),(712,'Anaheim',189,33.84,-117.86,'Анахайм'),(713,'Riverside',189,33.94,-117.39," +
                    "'Риверсайд'),(714,'San Juan',189,-31.54,-68.54,'Сан-Хуан'),(715,'Santa Ana',189,33.74,-117.88," +
                    "'Санта-Ана'),(716,'Henderson',189,36.01,-115.04,'Хендерсон'),(717,'Lexington',189,38.04,-84.46," +
                    "'Лексингтон'),(718,'Corpus Christi',189,27.73,-97.38,'Корпус-Кристи'),(719,'Stockton',189,37.98," +
                    "-121.31,'Стоктон'),(720,'St. Paul',189,44.95,-93.10,'Сент-Пол'),(721,'Cincinnati',189,39.14,-84" +
                    ".51,'Цинциннати'),(722,'Irvine',189,33.68,-117.77,'Ирвин'),(723,'Greensboro',189,36.10,-79.83," +
                    "'Гринсборо'),(724,'Pittsburgh',189,40.44,-79.98,'Питтсбург'),(725,'Lincoln',189,40.81,-96.68," +
                    "'Линкольн'),(726,'St. Louis',189,38.64,-90.25,'Сент-Луис'),(727,'Plano',189,33.05,-96.75," +
                    "'Плано'),(728,'Anchorage',189,61.15,-149.11,'Анкоридж'),(729,'Newark',189,40.72,-74.17,'Ньюарк')" +
                    ",(731,'Chula Vista',189,32.63,-117.01,'Чула Виста'),(732,'St. Petersburg',189,27.79,-82.67," +
                    "'Санкт-Петербург Флорида'),(733,'Jersey City',189,40.72,-74.07,'Джерси-Сити'),(734,'Fort Wayne'," +
                    "189,41.09,-85.14,'Форт Уэйн'),(735,'Toledo',189,41.66,-83.58,'Толедо'),(736,'Chandler',189,33" +
                    ".28,-111.85,'Чендлер'),(737,'Laredo',189,27.56,-99.49,'Ларедо'),(738,'Madison',189,43.08,-89.39," +
                    "'Мэдисон'),(739,'Scottsdale',189,33.69,-111.87,'Скоттсдейл'),(740,'Lubbock',189,33.57,-101.89," +
                    "'Лаббок'),(741,'Reno',189,39.55,-119.85,'Рино'),(742,'Gilbert',189,33.31,-111.75,'Гилберт')," +
                    "(743,'Buffalo',189,42.90,-78.85,'Буффало'),(744,'Glendale',189,33.58,-112.23,'Глендейл'),(745," +
                    "'North Las Vegas',189,36.29,-115.09,'Норт-Лас-Вегас'),(746,'Winston-Salem',189,36.10,-80.26," +
                    "'Уинстон-Салем'),(747,'Chesapeake',189,36.68,-76.30,'Чесапик'),(748,'Garland',189,32.91,-96.63," +
                    "'Гарленд'),(749,'Irving',189,32.86,-96.97,'Ирвинг'),(750,'Hialeah',189,25.87,-80.30,'Хайалиа')," +
                    "(751,'Norfolk',189,36.89,-76.26,'Норфолк'),(752,'Fremont',189,37.53,-121.99,'Фремонт'),(753," +
                    "'Boise',189,43.60,-116.23,'Бойсе'),(754,'Paradise',189,36.08,-115.14,'Парадайс'),(755," +
                    "'Richmond',189,37.53,-77.48,'Ричмонд'),(757,'Spokane',189,47.67,-117.43,'Спокан'),(758,'Tacoma'," +
                    "189,47.24,-122.45,'Такома'),(759,'Modesto',189,37.64,-121.00,'Модесто'),(760,'Fontana',189,34" +
                    ".10,-117.46,'Фонтана'),(761,'Des Moines',189,41.57,-93.61,'Де-Мойн'),(762,'San Bernardino',189," +
                    "34.14,-117.29,'Сан-Бернардино'),(763,'Baton Rouge',189,30.44,-91.13,'Батон-Руж'),(764,'Frisco'," +
                    "189,33.16,-96.82,'Фриско'),(765,'Salt Lake City',189,40.78,-111.93,'Солт-Лейк-Сити'),(766," +
                    "'Moreno Valley',189,33.92,-117.20,'Морено Вэлли'),(767,'Oxnard',189,34.20,-119.18,'Окснард')," +
                    "(768,'Santa Clarita',189,34.42,-118.50,'Санта-Кларита'),(770,'McKinney',189,33.20,-96.67," +
                    "'Маккинни'),(771,'Port St. Lucie',189,27.28,-80.39,'Порт-Сент-Люси'),(772,'Fayetteville',189,36" +
                    ".07,-94.17,'Фейетвилл'),(773,'Grand Rapids',189,42.96,-85.66,'Гранд-Рапидс'),(775,'Rochester'," +
                    "189,43.17,-77.62,'Рочестер'),(776,'Charleston',189,32.82,-79.96,'Чарльстон'),(777,'Palm " +
                    "Springs',189,26.63,-80.10,'Палм-Спрингс'),(778,'Sedona',189,34.86,-111.80,'Седона'),(779," +
                    "'Branson',189,36.65,-93.26,'Брэнсон'),(780,'Montreal',33,45.51,-73.56,'Монреаль'),(781," +
                    "'Calgary',33,51.05,-114.07,'Калгари'),(782,'Edmonton',33,53.53,-113.49,'Эдмонтон'),(783," +
                    "'Ottawa',33,45.42,-75.70,'Оттава'),(784,'Winnipeg',33,49.88,-97.15,'Виннипег'),(785,'Quebec " +
                    "City',33,46.81,-71.21,'Квебек'),(786,'Hamilton',33,43.26,-79.87,'Гамильтон'),(787,'Kitchener'," +
                    "33,43.42,-80.47,'Китченер'),(789,'Victoria',33,48.43,-123.36,'Виктория'),(790,'Halifax',33,44" +
                    ".65,-63.59,'Галифакс'),(791,'Oshawa',33,43.90,-78.85,'Ошава'),(792,'Windsor',33,42.28,-83.00," +
                    "'Виндзор'),(793,'Saskatoon',33,52.13,-106.68,'Саскатун'),(794,'St. Catharines',33,43.18,-79.23," +
                    "'Сент-Катаринс'),(795,'Regina',33,50.45,-104.61,'Регина'),(796,'St. Johns',33,47.48,-52.80," +
                    "'Сент-Джонс'),(797,'Kelowna',33,49.89,-119.50,'Келоуна'),(800,'Rishikesh',78,30.09,78.27," +
                    "'Ришикеш'),(801,'Gokarna',78,14.55,74.32,'Гокарна'),(802,'Arambol',78,15.70,73.70,'Арамболь')," +
                    "(803,'Tiruvannamalai',78,12.23,79.08,'Тируваннамалай'),(804,'Darjeeling',78,27.04,88.26," +
                    "'Дарджилинг'),(805,'Haridwar',78,29.94,78.15,'Харидвар'),(806,'Kanyakumari',78,8.08,77.55," +
                    "'Каньякумари'),(807,'Buddh Gaya',78,24.69,84.98,'Будд Гая'),(808,'Sarnath',78,25.37,83.03," +
                    "'Сарнатх'),(809,'Kushinagar',78,26.74,83.92,'Кушинагар'),(810,'Shrawasti',78,27.68,81.89," +
                    "'Шравасти'),(811,'Rajgir',78,25.03,85.42,'Раджгир'),(812,'Sankasya',78,30.37,76.36,'Санкасья')," +
                    "(813,'Tirumala',78,13.68,79.35,'Тирумала'),(814,'Badrinath',78,30.74,79.49,'Бадринатх'),(815," +
                    "'Kedarnath',78,30.73,79.07,'Кедарнатх'),(816,'Prayagraj',78,25.44,81.85,'Праяградж'),(817," +
                    "'Haridwar',78,29.95,78.16,'Харидвар'),(818,'Mathura',78,27.49,77.67,'Матхура'),(819,'Vrindavan'," +
                    "78,27.57,77.66,'Вриндаван'),(820,'Somnath',78,20.89,70.40,'Сомнатх'),(821,'Dwarka',78,22.24,68" +
                    ".97,'Дварка'),(822,'Jammu',78,32.73,74.86,'Джамму'),(823,'Ujjain',78,23.18,75.79,'Удджайн')," +
                    "(824,'Shirdi',78,19.76,74.48,'Ширди'),(825,'Palolem',78,15.01,74.02,'Палолем'),(826,'Varkala'," +
                    "78,8.74,76.72,'Варкала'),(827,'Alwar',78,27.55,76.63,'Алвар'),(828,'Amritapuri',78,9.09,76.49," +
                    "'Амритапури');";
            PreparedStatement statement = connection.prepareStatement(query);
            statement.execute();
            stringMaker("Table 'locations' added");
        } catch (SQLException e) {
            stringMaker("Problem with default insertion of locations");
        }
    }

    public static void insertDefaultTransportationTypes(Connection connection) {
        try {
            String query = "INSERT INTO transportation_types\n" +
                    "VALUES (1,'Flight'),(2,'Bus'),(3,'Train'),(4,'Car Drive'),(5,'Taxi'),(6,'Walk'),(7,'Town Car')," +
                    "(8,'Ride Share'),(9,'Shuttle'),(10,'Ferry'),(11,'Subway');";
            PreparedStatement statement = connection.prepareStatement(query);
            statement.execute();
            stringMaker("Table 'transportation_types' added");
        } catch (SQLException e) {
            stringMaker("Problem with default insertion of transportation_types");
        }
    }

    public static void stringMaker (String input) {
        System.out.println(input);
        stream.println(input);
    }
}